[
  {
    "type": "article",
    "key": "Mascarenhas2025-yv",
    "note": "(<strong>FI: 6.500</strong>)",
    "url": "https://doi.org/10.3390/cancers17152559",
    "doi": "10.3390/cancers17155559",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "keywords": "artificial intelligence; endometrial polyps; gynecology; hysteroscopy",
    "year": "<strong>2025</strong>",
    "month": "August",
    "pages": "2559",
    "number": "15",
    "volume": "17",
    "publisher": "MDPI AG",
    "journal": "Cancers (Basel)",
    "author": "Mascarenhas, Miguel and Peixoto, Carla and Freire, Ricardo and Cavaco Gomes, Joao and Cardoso, Pedro and Castro, Inês and Martins, Miguel and Mendes, Francisco and Mota, Joana and Almeida, Maria João and Silva, Fabiana and Gutierres, Luis and Mendes, Bruno and <strong>Ferreira, João</strong> and Mascarenhas, Teresa and Zulmira, Rosa",
    "title": "Artificial intelligence and hysteroscopy: A multicentric study on automated classification of pleomorphic lesions"
  },
  {
    "type": "article",
    "key": "Mascarenhas_Saraiva2025-hl",
    "note": "(<strong>FI: 8.200</strong>)",
    "url": "https://doi.org/10.14309/ajg.0000000000003756",
    "doi": "10.14309/ajg.0000000000003756",
    "language": "en",
    "keywords": "AI-assisted capsule endoscopy; artificial intelligence; capsule endoscopy",
    "year": "<strong>2025</strong>",
    "month": "August",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Mascarenhas Saraiva, Miguel and <strong>Ferreira, João</strong> and Afonso, João and Mendes, Francisco and Sonnier, William Preston and Rosa, Bruno and Ribeiro, Tiago and Gonçalves, Tiago Cúrdia and Martins, Miguel and Campelo, Pedro and Macedo, Cláudia and Cardoso, Pedro and Mota, Joana and Almeida, Maria João and Pinto da Costa, António and Pérez-Gonzalez, Ana and Mendoza, Jorge and Cavalcante, Thicianie Andrade and Fortes, Erika Borges and de Carvalho, Matheus and Dos Santos, Marcos Eduardo Lera and Andrade, Ana Patrı́cia and Cardoso, Hélder and de Moura, Eduardo Horneaux and Santander, Cec\\ĺio and di Palma, Jack and Cotter, José and Macedo, Guilherme",
    "title": "Real-life clinical validation of artificial intelligence-assisted detection and differentiation of pleomorphic lesions in capsule endoscopy"
  },
  {
    "type": "article",
    "key": "Mascarenhas_Saraiva2025-tu",
    "note": "(<strong>FI: 2.900</strong>)",
    "url": "https://doi.org/10.1136/bmjgast-2024-001655",
    "doi": "10.1136/bmjgast-2024-001655",
    "language": "en",
    "keywords": "colonic adenomas; colonic diseases; colonic polyps; small bowel",
    "year": "<strong>2025</strong>",
    "month": "September",
    "pages": "e001655",
    "number": "1",
    "volume": "12",
    "publisher": "BMJ",
    "journal": "BMJ Open Gastroenterol.",
    "author": "Mascarenhas Saraiva, Miguel José and Almeida, Maria João and Martins, Miguel and Afonso, João and Ribeiro, Tiago and Sá Cardoso, Pedro Marı́lio Moreira and Costa Silva Mendes, Francisco Miguel and Mota, Joana and Andrade, Ana Patricia and Cardoso, Helder and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Deep learning and capsule endoscopy: automatic panendoscopic detection of protruding lesions"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-se",
    "note": "(<strong>FI: 4.379</strong>)",
    "url": "https://doi.org/10.1038/s41598-025-14514-x",
    "doi": "10.1038/s41598-025-14514-x",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by-nc-nd/4.0",
    "keywords": "Anal squamous cell carcinoma; Artificial intelligence; Cervical squamous cell carcinoma; Colposcopy; HSIL; LSIL",
    "year": "<strong>2025</strong>",
    "month": "September",
    "pages": "33068",
    "number": "1",
    "volume": "15",
    "publisher": "Springer Science and Business Media LLC",
    "journal": "Sci. Rep.",
    "author": "Mascarenhas, Miguel and Martins, Miguel and Barroso, Luı́s and Spindler, Lucas and Fathallah, Nadia and Manzione, Thiago and Alencoão, Inês and Carinhas, Maria João and Ribeiro, Tiago and Mendes, Francisco and Cardoso, Pedro and Almeida, Maria João and Mota, Joana and Fernandes, Joana and <strong>Ferreira, João</strong> and Mascarenhas, Teresa and Nadal, Sidney and Zulmira, Rosa and Macedo, Guilherme and de Parades, Vincent",
    "title": "Automated detection and classification of cervical and anal squamous cancer precursors using deep learning and multidevice colposcopy"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-vj",
    "note": "(<strong>FI: 3.000</strong>)",
    "url": "https://doi.org/10.3390/jcm14197065",
    "doi": "10.3390/jcm14197065",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "keywords": "HSIL; LSIL; artificial intelligence; colposcopy; vulvar squamous cell carcinoma",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "7065",
    "number": "19",
    "volume": "14",
    "publisher": "MDPI AG",
    "journal": "J. Clin. Med.",
    "author": "Mascarenhas, Miguel and Sivalingam, Vanitha and Castro, Inês and Jones, Katie and Martins, Miguel and Alencoão, Inês and Carinhas, Maria João and Mota, Joana and Cardoso, Pedro and Mendes, Francisco and Almeida, Maria João and Mendes, Bruno and <strong>Ferreira, João</strong> and Macedo, Guilherme and Mascarenhas, Teresa and Javed, Ahsan and Macedo, Rosa Zulmira",
    "title": "Artificial intelligence and colposcopy: Detection and classification of vulvar HPV-related low-grade and high-grade squamous intraepithelial lesions"
  },
  {
    "type": "article",
    "key": "Andrade2025-fn",
    "note": "(<strong>FI: 12.200</strong>)",
    "url": "https://doi.org/10.1016/j.cgh.2024.09.018",
    "doi": "10.1016/j.cgh.2024.09.018",
    "language": "en",
    "keywords": "artificial intelligence; capsule endoscopy; inflammatory bowel disease",
    "year": "<strong>2025</strong>",
    "month": "October",
    "publisher": "Elsevier BV",
    "journal": "Clin. Gastroenterol. Hepatol.",
    "author": "Andrade, Patrı́cia and Mascarenhas, Miguel and Mendes, Francisco and Rosa, Bruno and Cardoso, Pedro and Afonso, João and Ribeiro, Tiago and Martins, Miguel and Mota, Joana and Almeida, Maria João and Gonçalves, Tiago Cúrdia and Campelo, Pedro and Macedo, Cláudia and Pinto da Costa, António and Santander, Cec\\ĺio and di Palma, Jack and <strong>Ferreira, João</strong> and Cotter, José and Macedo, Guilherme",
    "title": "Ai-assisted capsule endoscopy for detection of ulcers and erosions in Crohn's disease: A multicenter validation study"
  },
  {
    "type": "article",
    "key": "Rosa2025-fp",
    "note": "(<strong>FI: 2.900</strong>)",
    "url": "https://doi.org/10.1136/bmjgast-2025-001906",
    "doi": "10.1136/bmjgast-2025-001906",
    "language": "en",
    "keywords": "COLONIC DISEASES; GASTROINTESTINAL BLEEDING; SMALL BOWEL DISEASE; SMALL BOWEL ENTEROSCOPY",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "e001906",
    "number": "1",
    "volume": "12",
    "publisher": "BMJ",
    "journal": "BMJ Open Gastroenterol.",
    "author": "Rosa, Bruno and Mascarenhas Saraiva, Miguel José and Afonso, João and Cúrdia Gonçalves, Tiago and Mendes, Francisco and Moreira, Maria João and Martins, Miguel and Dias de Castro, Francisca and Ribeiro, Tiago and Cardoso, Pedro and Almeida, Maria João and Mota, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme and Cotter, José",
    "title": "Artificial intelligence-assisted versus conventional reading in pan-intestinal capsule endoscopy for suspected mid-lower gastrointestinal bleeding: a retrospective analysis of a prospective cohort"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-fl",
    "note": "(<strong>FI: 4.500</strong>)",
    "url": "https://doi.org/10.14309/ctg.0000000000000941",
    "doi": "10.14309/ctg.0000000000000941",
    "language": "en",
    "keywords": "Artificial intelligence; Esophageal motility disorders; High-resolution esophageal manometry; Machine learning",
    "year": "<strong>2025</strong>",
    "month": "October",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Clin. Transl. Gastroenterol.",
    "author": "Mascarenhas, Miguel and Mota, Joana and Cordeiro, João Rala and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and Almeida, Maria João and Pinto da Costa, Antonio and Martinez, Ismael Hajra and Royo, Virginia Matallana and Niland, Benjamin and Di Palma, Jack and <strong>Ferreira, João</strong> and Macedo, Guilherme and Santander, Cecilio",
    "title": "Artificial intelligence driven diagnosis of motility patterns in high-resolution esophageal manometry - A multicentric multidevice study"
  },
  {
    "type": "article",
    "key": "pocas20251234",
    "note": "(<strong>FI: 2.900</strong>)",
    "doi": "10.1007/s10151-025-03160-0",
    "url": "https://doi.org/10.1007/s10151-025-03160-0",
    "language": "en",
    "keywords": "Anal fissure; Anal laceration; Artificial intelligence; Endoanal ultrasound",
    "year": "<strong>2025</strong>",
    "month": "June",
    "pages": "132",
    "number": "1",
    "volume": "29",
    "journal": "Tech. Coloproctol.",
    "author": "Mascarenhas, M and Almeida, M J and Martins, M and Mendes, F and Mota, J and Cardoso, P and Mendes, B and <strong>Ferreira J</strong> and Macedo, G and Poças, C",
    "title": "Artificial intelligence and endoanal ultrasound: pioneering automated differentiation of benign anal and sphincter lesions"
  },
  {
    "type": "article",
    "key": "Martins2025-eb11",
    "note": "(<strong>FI: 3.900</strong>)",
    "doi": "10.1038/s41598-025-03397-7",
    "url": "https://doi.org/10.1038/s41598-025-03397-7",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by-nc-nd/4.0",
    "keywords": "Artificial intelligence; Capsule endoscopy; Esophageal lesions; Gastric lesions; Panendoscopy",
    "year": "<strong>2025</strong>",
    "month": "July",
    "pages": "22889",
    "number": "1",
    "volume": "15",
    "publisher": "Springer Science and Business Media LLC",
    "journal": "Sci. Rep.",
    "author": "Martins, Miguel and Mascarenhas, Miguel José and Almeida, Maria João and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Mota, Joana and Andrade, Patrı́cia and Cardoso, Hélder and Mascarenhas-Saraiva, Miguel and <strong>João Ferreira</strong> and Macedo, Guilherme",
    "title": "A ubiquitous and interoperable deep learning model for automatic detection of pleomorphic gastroesophageal lesions"
  },
  {
    "type": "article",
    "key": "eduardo2025aaa",
    "note": "(<strong>FI: 2.500</strong>)",
    "url": "https://doi.org/10.1177/14644207251330497",
    "doi": "10.1177/14644207251330497",
    "year": "<strong>2025</strong>",
    "number": "0",
    "volume": "0",
    "journal": "Proceedings of the Institution of Mechanical Engineers, Part L",
    "title": "Development of data-driven constitutive models: Applications in the finite element simulation of hyperelastic materials",
    "author": "Eduardo Carvalho and <strong>João PS Ferreira</strong> and Renato M. Natal Jorge and Marco P. L. Parente"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-fc",
    "note": "(<strong>FI: 3.800</strong>)",
    "url": "https://doi.org/10.3390/jcm14020549",
    "doi": "10.3390/jcm14020549",
    "language": "en",
    "keywords": "Artificial intelligence; Biliary strictures; Digital cholangioscopy",
    "year": "<strong>2025</strong>",
    "month": "February",
    "pages": "5447",
    "number": "1",
    "volume": "15",
    "journal": "Sci. Rep.",
    "author": "Mascarenhas, Miguel and Almeida, Maria João and González-Haba, Mariano and Castillo, Belén Agudo and Widmer, Jessica and Costa, António and Fazel, Yousef and Ribeiro, Tiago and Mendes, Francisco and Martins, Miguel and Afonso, João and Cardoso, Pedro and Mota, Joana and Fernandes, Joana and <strong>Ferreira, João</strong> and Boas, Filipe Vilas and Pereira, Pedro and Macedo, Guilherme",
    "title": "Artificial intelligence for automatic diagnosis and pleomorphic morphological characterization of malignant biliary strictures using digital cholangioscopy"
  },
  {
    "type": "article",
    "key": "Saraiva2025-wg",
    "note": "(<strong>FI: 3.000</strong>)",
    "url": "https://doi.org/10.3390/jcm14020572",
    "doi": "10.3390/jcm14020572",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "keywords": "ChatGPT-4; artificial intelligence; capsule endoscopy; convolutional neural networks; device-assisted enteroscopy; digital single-operator cholangioscopy; endoscopic ultrasound; high-resolution anoscopy",
    "year": "<strong>2025</strong>",
    "month": "January",
    "pages": "572",
    "number": "2",
    "volume": "14",
    "publisher": "MDPI AG",
    "author": "Saraiva, Miguel Mascarenhas and Ribeiro, Tiago and Agudo, Belén and Afonso, João and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and Mota, Joana and Almeida, Maria Joao and Costa, António and Gonzalez Haba Ruiz, Mariano and Widmer, Jessica and Moura, Eduardo and Javed, Ahsan and Manzione, Thiago and Nadal, Sidney and Barroso, Luis F and de Parades, Vincent and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Evaluating ChatGPT-4 for the interpretation of images from several diagnostic techniques in gastroenterology"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-sv",
    "note": "(<strong>FI: 3.000</strong>)",
    "url": "https://doi.org/10.3390/jcm14020549",
    "doi": "10.3390/jcm14020549",
    "language": "en",
    "keywords": "artificial intelligence; explainable AI; gastroenterology; gastrointestinal endoscopy",
    "year": "<strong>2025</strong>",
    "month": "January",
    "number": "2",
    "volume": "14",
    "journal": "J. Clin. Med.",
    "author": "Mascarenhas, Miguel and Mendes, Francisco and Martins, Miguel and Ribeiro, Tiago and Afonso, João and Cardoso, Pedro and <strong>Ferreira, João</strong> and Fonseca, João and Macedo, Guilherme",
    "title": "Explainable AI in digestive healthcare and gastrointestinal endoscopy"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-kv",
    "note": "(<strong>FI: 3.800</strong>)",
    "url": "https://doi.org/10.1038/s41598-024-83768-8",
    "doi": "10.1038/s41598-024-83768-8",
    "language": "en",
    "keywords": "Anorectal disorders; Anorectal manometry; Artificial intelligence; Gastroenterology; Machine learning",
    "year": "<strong>2025</strong>",
    "month": "January",
    "pages": "2061",
    "number": "1",
    "volume": "15",
    "journal": "Sci. Rep.",
    "author": "Mascarenhas, Miguel and Mendes, Francisco and Mota, Joana and Ribeiro, Tiago and Cardoso, Pedro and Martins, Miguel and Almeida, Maria João and Cordeiro, João Rala and <strong>Ferreira, João</strong> and Macedo, Guilherme and Santander, Cecilio",
    "title": "Artificial intelligence as a transforming factor in motility disorders-automatic detection of motility patterns in high-resolution anorectal manometry"
  },
  {
    "type": "article",
    "key": "Ruiz2025-mo",
    "note": "(<strong>FI: 1.200</strong>)",
    "url": "https://doi.org/10.1016/j.tige.2024.250902",
    "doi": "10.1016/j.tige.2024.250902",
    "language": "en",
    "year": "<strong>2025</strong>",
    "pages": "250902",
    "number": "1",
    "volume": "27",
    "publisher": "Elsevier BV",
    "journal": "Tech. Innov. Gastrointest. Endosc.",
    "author": "Ruiz, Mariano González-Haba and Pereira, Pedro and Widmer, Jessica and Ribeiro, Tiago and Castillo, Belén Agudo and Vilas-Boas, Filipe and <strong>Ferreira, João</strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme",
    "title": "Real-life application of artificial intelligence for automatic characterization of biliary strictures: A transatlantic experience"
  },
  {
    "type": "article",
    "key": "Martins2025-kj",
    "note": "(<strong>FI: 2.838</strong>)",
    "url": "https://doi.org/10.3390/app15020709",
    "doi": "10.3390/app15020709",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2025</strong>",
    "month": "January",
    "pages": "709",
    "number": "2",
    "volume": "15",
    "publisher": "MDPI AG",
    "journal": "Appl. Sci. (Basel)",
    "author": "Martins, Miguel and Mascarenhas, Miguel and Almeida, Maria João and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Mota, Joana and Andrade, Patrı́cia and Cardoso, Hélder and Mascarenhas-Saraiva, Miguel and Ferreira, João and Macedo, Guilherme",
    "title": "Deep learning and automatic detection of pleomorphic esophageal lesions—A necessary step for minimally invasive panendoscopy"
  },
  {
    "type": "article",
    "key": "Martins2025-qe",
    "doi": "10.14309/01.ajg.0001129748.02957.10",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S122–S123",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Martins, Miguel and Mascarenhas Saraiva, Miguel and Barroso, Luis and Manzione, Thiago and Diaz Denoso, Pedro and Alan, Amine and Spindler, Lucas and Javed, Ahsan and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Almeida, Maria João and Mota, Joana and Santos, André and Costa, António and Fathallah, Nadia and Nadal, Sidney and La Rosa, Luciana and <strong>Ferreira, João</strong> and Macedo, Guilherme and De Parades, Vincent",
    "title": "S572 deep learning and high resolution anoscopy: First trinary interoperable model for detecting and differentiating clinically relevant anal lesions"
  },
  {
    "type": "article",
    "key": "Martins2025-ow",
    "doi": "10.14309/01.ajg.0001140816.37012.85",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S719–S719",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Martins, Miguel and Gonzalez Haba, Mariano and Mendes, Francisco and Cardoso, Pedro and Almeida, Maria João and Mota, Joana and Pereira, Pedro and Widmer, Jessica and Ribeiro, Tiago and Agudo, Belen and Vilas Boas, Filipe and <strong>Ferreira, João</strong> and Mascarenhas Saraiva, Miguel",
    "title": "S3339 enhancing diagnosis of indeterminate biliary strictures: A case series using AI–enhanced cholangioscopy"
  },
  {
    "type": "article",
    "key": "Martins2025-qo",
    "doi": "110.14309/01.ajg.0001126848.26757.36",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S21–S21",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Martins, Miguel and Mascarenhas Saraiva, Miguel and Agudo, Belen and Mendes, Francisco and Costa, António and Ribeiro, Tiago and Mota, Joana and Almeida, Maria João and Cardoso, Pedro and Afonso, João and De la Iglesia Garcia, Daniel and Fernández-Zarza, Carlos Esteban and Garcia Garcia de Paredes, Ana and Moris, Maria and Ferreira de Carvalho, Matheus and Lera dos Santos, Marcos Eduardo and <strong>Ferreira, João</strong> and Widmer, Jessica and Vilas Boas, Filipe and Moutinho Ribeiro, Pedro and Lopes, Susana and Gonzalez Haba, Mariano and Hourneaux De Moura, Eduardo and Macedo, Guilherme",
    "title": "S97 deep learning for lymph node detection and malignancy risk stratification in endoscopic ultrasound: A multicenter proof of concept study"
  },
  {
    "type": "article",
    "key": "Mascarenhas_Saraiva2025-pb",
    "doi": "10.14309/01.ajg.0001129344.47663.50",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S101–S101",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Mascarenhas Saraiva, Miguel and Almeida, Maria João and Martins, Miguel and Mendes, Francisco and Mota, Joana and Cardoso, Pedro and Ribeiro, Tiago and Afonso, João and Andrade, Patrı́cia and Martins Pinto da Costa, António Miguel M P D and Diaz Denoso, Pedro and Arias, Jorge and <strong>Ferreira, João</strong> and Mendes, Bruno and Ferreira de Carvalho, Matheus and Macedo, Guilherme and Poças, Castro",
    "title": "S471 artificial intelligence in endoanal ultrasound: A multicentric study on a multilesion model for benign anorectal lesion detection and differentiation"
  },
  {
    "type": "article",
    "key": "Mendes2025-qt",
    "doi": "10.14309/01.ajg.0001126660.87473.cc",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S11–S11",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Mendes, Francisco and Mascarenhas Saraiva, Miguel and Costa, António and Agudo, Belen and Widmer, Jessica and Siddiqui, Uzma and Ribeiro, Tiago and Martins, Miguel and Cardoso, Pedro and Mota, Joana and Almeida, Maria João and Afonso, João and Kim, Grace and De la Iglesia garcia, Daniel and Peréz Gonzalez, Ana and Fernandez-Zarza, Carlos Esteban and Moris, Maria and Ferreira de Carvalho, Matheus and Lera dos Santos, Marcos Eduardo and <strong>Ferreira, João</strong> and Gonda, Tamas and Santos, André and Vilas Boas, Filipe and Moutinho Ribeiro, Pedro and Pereira, Pedro and Gonzalez Haba, Mariano and Hourneaux De Moura, Eduardo and Macedo, Guilherme",
    "title": "S50 decoding biliary strictures: A transatlantic multicenter study on AI performance across lesion topography"
  },
  {
    "type": "article",
    "key": "Mascarenhas_Saraiva2025-ql",
    "doi": "10.14309/01.ajg.0001127412.10674.0b",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S50–S50",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Mascarenhas Saraiva, Miguel and Martins Pinto da Costa, António Miguel and Mendes, Francisco and Agudo, Belen and Widmer, Jessica and Siddiqui, Uzma D and Ribeiro, Tiago and Martins, Miguel and Cardoso, Pedro and Mota, Joana and Almeida, Maria João and Afonso, João and Kim, G E and De la Iglesia Garcia, Daniel and Pérez González, Ana and Fernández-Zarza, Carlos Esteban and Garcia Garcia de Paredes, Ana and Moris, Maria and Ferreira de Carvalho, Matheus and Lera dos Santos, Marcos Eduardo and Villaroel, Mariano and Montoya, Andrés and <strong>Ferreira, João</strong> and Kok, Khoon-Sheng and Gonda, Tamas and Gornals, Joan-Berenguer and Adams, Masson and Di Palma, Jack and Martins dos Santos, André and Vilas Boas, Filipe and Moutinho Ribeiro, Pedro and Lopes, Susana and Gonzalez Haba, Mariano and Hourneaux De Moura, Eduardo and Macedo, Guilherme",
    "title": "S238 artificial intelligence for comprehensive pancreatic lesion profiling: Multicenter validation of solid/cystic lesion detection/characterization and IPMN grading"
  },
  {
    "type": "article",
    "key": "Mendes2025-ss",
    "doi": "10.14309/01.ajg.0001140560.38044.6b",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "October",
    "pages": "S705–S705",
    "number": "10S2",
    "volume": "120",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "Am. J. Gastroenterol.",
    "author": "Mendes, Francisco and Gonzalez Haba, Mariano and Widmer, Jessica and Martins, Miguel and Costa, António and Ribeiro, Tiago and Agudo, Belen and Ferreira de Carvalho, Matheus and Lera dos Santos, Marcos Eduardo and Hourneaux De Moura, Eduardo and Vilas Boas, Filipe and Moutinho Ribeiro, Pedro and Lopes, Susana and <strong>Ferreira, João</strong> and Mascarenhas Saraiva, Miguel and Macedo, Guilherme",
    "title": "S3275 AI-driven endoscopic ultrasound – A case series of applications in multiple clinical settings"
  },
  {
    "type": "article",
    "key": "Cardoso2025-ei07",
    "doi": "10.1016/S0016-5085(25)02400-X",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S–636–S–637",
    "number": "1",
    "volume": "169",
    "publisher": "Elsevier BV",
    "journal": "Gastroenterology",
    "author": "Cardoso, Pedro and Saraiva, Miguel M and Mendes, Francisco and Afonso, João and Martins, Miguel and Almeida, Maria João and Mota, Joana and Andrade, Patrı́cia and Cardoso, Hélder and Fernandes, Joana and <strong>Ferreira, João</strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme",
    "title": "Sa2061: DEEP LEARNING AND AUTOMATIC CAPSULE ENDOSCOPY SEGMENTATION – A STEP TOWARDS AI-ASSISTED CAPSULE PANENDOSCOPY"
  },
  {
    "type": "article",
    "key": "Saraiva2025-ob03",
    "doi": "10.1016/S0016-5085(25)04081-8",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S–1390–S–1391",
    "number": "1",
    "volume": "169",
    "publisher": "Elsevier BV",
    "journal": "Gastroenterology",
    "author": "Saraiva, Miguel M and Mendes, Francisco and Cordeiro, João Rala and Mota, Joana and Martins, Miguel and Cardoso, Pedro and da Costa, Antonio Miguel M Pinto and Martinez, Ismael e and Royo, Virginia Matallana and Niland, Benjamin and Di Palma, Jack and <strong>Ferreira, João</strong> and Macedo, Guilherme and Santander, Cecilio",
    "title": "Tu1289: ARTIFICIAL INTELLIGENCE DRIVEN DIAGNOSIS OF MOTILITY PATTERNS IN HIGH-RESOLUTION ESOPHAGEAL MANOMETRY – A TRANSATLANTIC MULTICENTRIC MULTIDEVICE STUDY"
  },
  {
    "type": "article",
    "key": "Saraiva2025-lf53",
    "doi": "10.1016/j.gie.2025.03.010",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S2–S3",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Agudo, Belen and Pinto da Costa, Antonio Miguel M and Ribeiro, Tiago F and Afonso, João and Martins, Miguel and Mendes, Francisco and Mota, Joana and Almeida, Maria João and Iglesia, Daniel de la and Esteban, Carlos and Garcia de Paredes, Ana Garcia and Moris, Maria and de Carvalho, Matheus F and Lera Dos Santos, Marcos Eduardo and <strong>Ferreira, João</strong> and Widmer, Jessica L and Boas, Filipe Vilas and Haba, Mariano Gonzalez and De Moura, Eduardo G and Macedo, Guilherme",
    "title": "Artificial intelligence for lymph node detection and malignancy prediction in endoscopic ultrasound: A multicenter transatlantic study"
  },
  {
    "type": "article",
    "key": "Saraiva2025-gj13",
    "doi": "10.1016/j.gie.2025.03.061",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S33–S34",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Almeida, Maria João and Martins, Miguel and Mendes, Francisco and Mota, Joana and Cardoso, Pedro and Pinto da Costa, Antonio Miguel M and <strong>Ferreira, João</strong> and Mendes, Bruno and Macedo, Guilherme and Pocas, Fernando C",
    "title": "Artificial intelligence and endoanal ultrasound: Innovating automated analysis of benign anal injuries"
  },
  {
    "type": "article",
    "key": "Saraiva2025-ft44",
    "doi": "10.1016/j.gie.2025.03.101",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S55",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Rosa, Bruno and Afonso, João and Gonçalves, Tiago Cúrdia and Mendes, Francisco and Moreira, Maria João and Martins, Miguel and De Castro, Francisca Dias and Ribeiro, Tiago F and Cardoso, Pedro and Almeida, Maria João and Mota, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme and Cotter, José",
    "title": "Unveiling the potential of artificial intelligence in pan-intestinal capsule endoscopy: A paradigm shift for GI diagnostics"
  },
  {
    "type": "article",
    "key": "Saraiva2025-ps3",
    "doi": "10.1016/j.gie.2025.03.030",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S13–S14",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Agudo, Belen and Mendes, Francisco and Widmer, Jessica L and Ribeiro, Tiago F and Pinto da Costa, Antonio and Martins, Miguel and Mota, Joana and Almeida, Maria João and Iglesia, Daniel de la and Esteban, Carlos and Garcia de Paredes, Ana Garcia and Moris, Maria and de Carvalho, Matheus F and Lera Dos Santos, Marcos Eduardo and <strong>Ferreira, João</strong> and Boas, Filipe Vilas and Haba, Mariano Gonzalez and De Moura, Eduardo G and Macedo, Guilherme",
    "title": "Artificial intelligence for pancreatic cyst dysplasia grading: A multicenter endoscopic ultrasound study"
  },
  {
    "type": "article",
    "key": "Saraiva2025-kd4",
    "doi": "10.1016/j.gie.2025.03.032",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S15",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Mendes, Francisco and Afonso, João and Ribeiro, Tiago F and Martins, Miguel and Cardoso, Pedro and Mota, Joana and Almeida, Maria João and Pinto da Costa, Antonio and Pérez-González, Ana and Andrade Cavalcante, Thicianie Fauve and Fortes, Erika Borges and de Carvalho, Matheus F and Gonçalves, Tiago Cúrdia and Campelo, Pedro and Macedo, Claudia and Lera Dos Santos, Marcos Eduardo and De Moura, Eduardo G and Santander, Cecilio and Rosa, Bruno and Cotter, José and Di Palma, Jack and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Real-life clinical validation of Ai-assisted detection and differentiation of pleomorphic lesions in capsule endoscopy: A transatlantic multicentric study"
  },
  {
    "type": "article",
    "key": "Martins2025-fa12",
    "doi": "10.1016/j.gie.2025.03.076",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S41–S42",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Martins, Miguel and Saraiva, Miguel M and Barroso, Luis and Spindler, Lucas and Manzione, Thiago and Ashamed, Javed and Afonso, João and Ribeiro, Tiago F and Cardoso, Pedro and Mendes, Francisco and Almeida, Maria João and Mota, Joana and Fathallah, Nadia and Nadal, Sidney R and <strong>Ferreira, João</strong> and Macedo, Guilherme and de Parades, Vincent",
    "title": "An interoperable artificial intelligence model for automatic characterization of pleomorphic anal hpv-related dysplastic lesions: A multicentric study"
  },
  {
    "type": "article",
    "key": "Pinto_da_Costa2025-mc11",
    "doi": "10.1016/j.gie.2025.03.011",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S3–S4",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Pinto da Costa, Antonio Miguel M and Saraiva, Miguel M and Cardoso, Pedro and Rosa, Bruno and Mendes, Francisco and Afonso, João and Ribeiro, Tiago F and Martins, Miguel and Mota, Joana and Almeida, Maria João and Gonçalves, Tiago Cúrdia and Campelo, Pedro and Macedo, Claudia and Santander, Cecilio and Di Palma, Jack and <strong>Ferreira, João</strong> and Cotter, José and Macedo, Guilherme",
    "title": "Shaping the future of ibd diagnostics: A multicentric Ai - driven capsule endoscopy study"
  },
  {
    "type": "article",
    "key": "Saraiva2025-nv31",
    "doi": "10.1016/j.gie.2025.03.031",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S14–S15",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Haba, Mariano Gonzalez and Ribeiro, Tiago F and Pinto da Costa, Antonio and Mendes, Francisco and Martins, Miguel and Afonso, João and Mota, Joana and Almeida, Maria João and Cardoso, Pedro and Agudo, Belen and Lera Dos Santos, Marcos Eduardo and De Moura, Eduardo G and Widmer, Jessica L and Boas, Filipe Vilas and Pereira, Pedro and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Mapping malignancy: Addressing topographic challenges in biliary stricture Ai analysis - a multicentric transatlantic study"
  },
  {
    "type": "article",
    "key": "Saraiva2025-iw22",
    "doi": "10.1016/j.gie.2025.03.057",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "May",
    "pages": "S31",
    "number": "5",
    "volume": "101",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel M and Ribeiro, Tiago F and Agudo, Belen and Afonso, João and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and Mota, Joana and Almeida, Maria João and Pinto da Costa, Antonio Miguel M and Haba, Mariano Gonzalez and Widmer, Jessica L and De Moura, Eduardo G and Javed, Ahsan and Manzione, Thiago and Nadal, Sidney R and Barroso, Luis and de Parades, Vincent and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Deep learning versus generative Ai in gastrointestinal endoscopy: Convolutional neural networks outperform chatgpt-4 in gastrointestinal imaging analysis"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-uy1",
    "doi": "10.1055/s-0045-1806337",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S515–S516",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Mascarenhas, M and Mendes, F and Afonso, J and Ribeiro, T and Martins, M and Marı́lio Cardoso, P and Mota, J and Almeida, M J and Cardoso, H and Cúrdia, G and Campelo, P and Macedo, C and Martins Pinto da Costa, A and Rosa, B and Cotter, J and Santander, C and Palma, J D and <strong>Ferreira, J</strong> and Guilherme, M",
    "title": "AI-assisted capsule endoscopy – first multicentric transatlantic detection and differentiation validation study"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-oa1",
    "doi": "10.1055/s-0045-1805462",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S185–S185",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Mascarenhas, M and Almeida, M J and Martins, M and Mendes, F and Mota, J and Pedro, C and <strong>Ferreira, J</strong> and Mendes, B and Guilherme, M and Poças, F",
    "title": "Artificial intelligence and endoanal ultrasound: Pioneering automated differentiation of benign anal and sphincter lesions"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-gq1",
    "doi": "10.1055/s-0045-1806335",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S514–S515",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Mascarenhas, M and Ribeiro, T and Agudo, B and Afonso, J and Mendes, F and Martins, M and Marı́lio Cardoso, P and Mota, J and Almeida, M J and Martins Pinto da Costa, A and González-Haba Ruiz, M and Widmer, J and Hourneaux de Moura, E G and Javed, A and Manzione, T and Sidney, N and Barroso, L and Parades, V D and <strong>Ferreira, J</strong> and Guilherme, M",
    "title": "Evaluating the potential of generative AI in digestive endoscopy: ChatGPT-4 for advanced image analysis in gastroenterology"
  },
  {
    "type": "article",
    "key": "Gonzalez-Haba_Ruiz2025-um1",
    "doi": "10.1055/s-0045-1805281",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S94–S95",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "González-Haba Ruiz, M and Mascarenhas Saraiva, M and Ribeiro, T and António, Mmpd C and Mendes, F and Martins, M and Afonso, J P and Mota, J and Almeida, M J and Pedro, C and Agudo, B and <strong>Ferreira, J</strong> and Widmer, J and Guilherme, M",
    "title": "Impact of biliary stricture topography on the performance of artificial intelligence algorithms for digital single-operator cholangioscopy: a multicenter, transatlantic, study"
  },
  {
    "type": "article",
    "key": "Rosa2025-yz1",
    "doi": "10.1055/s-0045-1805169",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S41–S41",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Rosa, B and Mascarenhas Saraiva, M and Afonso, J and Cúrdia Gonçalves, T and Mendes, F and Moreira, M J and Martins, M and Dias De Castro, F and Ribeiro, T and Marı́lio Cardoso, P and Almeida, M J and Mota, J and <strong>Ferreira, J</strong> and Guilherme, M and Cotter, J",
    "title": "Unveiling the potential of artificial intelligence in pan-intestinal capsule endoscopy: A paradigm shift for GI diagnostics"
  },
  {
    "type": "article",
    "key": "Martins2025-tt1",
    "doi": "10.1055/s-0045-1805183",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S47–S47",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Martins, M and Mascarenhas, M and Lucas, S and Barroso, L and Manzione, T and Javed, A and Marı́lio Cardoso, P and Mendes, F and Almeida, M J and Mota, J and Fathallah, N and Sidney, N and <strong>Ferreira, J</strong> and Guilherme, M and Parades, V D",
    "title": "Artificial intelligence for automatic detection and differentiation of anal HPV-related dysplastic lesions: An interoperable multicentric study"
  },
  {
    "type": "article",
    "key": "Mendes2025-sw1",
    "doi": "10.1055/s-0045-1805185",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S48–S48",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Mendes, F and Mascarenhas, M and Afonso, J and Martins, M and Marı́lio Cardoso, P and Almeida, M J and Mota, J and Andrade, P and Cardoso, H and Fernandes, J and <strong>Ferreira, J</strong> and Mascarenhas Saraiva, M and Guilherme, M",
    "title": "Deep learning and automatic capsule endoscopy segmentation – A crucial step towards AI-assisted capsule panendoscopy"
  },
  {
    "type": "article",
    "key": "Agudo2025-ty1",
    "doi": "10.1055/s-0045-1805316",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S112–S113",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Agudo, B and Martins Pinto da Costa, A and Ribeiro, T and Martins, M and Mendes, F and Mota, J and Almeida, M J and De La Iglesia-Garcia, D and Esteban Fernández-Zarza, C and Garcia Garcia de Paredes, A and Moris, M and <strong>Ferreira, J</strong> and González-Haba Ruiz, M and Guilherme, M and Mascarenhas, M",
    "title": "Predicting lymph node malignancy with convolutional neural networks: Insights from a transatlantic and multicenter study in endoscopic ultrasound"
  },
  {
    "type": "article",
    "key": "Mascarenhas2025-ar",
    "doi": "https://doi.org/10.1055/s-0045-1805462",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S185–S185",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "Mascarenhas, M and Almeida, M J and Martins, M and Mendes, F and Mota, J and Pedro, C and <strong>Ferreira, J</strong> and Mendes, B and Guilherme, M and Pocas, F",
    "title": "Artificial intelligence and endoanal ultrasound: Pioneering automated differentiation of benign anal and sphincter lesions"
  },
  {
    "type": "article",
    "key": "Gonzalez-Haba_Ruiz2025-tl",
    "doi": "https://doi.org/10.1055/s-0045-1805281",
    "language": "en",
    "year": "<strong>2025</strong>",
    "month": "March",
    "pages": "S94–S95",
    "number": "S 02",
    "volume": "57",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "Endoscopy",
    "author": "González-Haba Ruiz, M and Mascarenhas Saraiva, M and Ribeiro, T and António, Mmpd C and Mendes, F and Martins, M and Afonso, J P and Mota, J and Almeida, M J and Pedro, C and Agudo, B and <strong>Ferreira, J</strong> and Widmer, J and Guilherme, M",
    "title": "Impact of biliary stricture topography on the performance of artificial intelligence algorithms for digital single-operator cholangioscopy: a multicenter, transatlantic, study"
  },
  {
    "type": "article",
    "key": "Cardoso2025-wd",
    "doi": "https://doi.org/10.1093/ecco-jcc/jjae190.0128",
    "language": "en",
    "copyright": "https://academic.oup.com/pages/standard-publication-reuse-rights",
    "year": "<strong>2025</strong>",
    "month": "January",
    "pages": "i247–i247",
    "number": "Supplement_1",
    "volume": "19",
    "publisher": "Oxford University Press (OUP)",
    "journal": "J. Crohns. Colitis",
    "author": "Cardoso, P and Mascarenhas, M and Mendes, F and Afonso, J and Ribeiro, T and Martins, M and Mota, J and Almeida, M J and Cúrdia Gonçalves, T and Campelo, P and Macedo, C and Costa, A and Santander, C and di Palma, J and <strong>Ferreira, J</strong> and Cotter, J and Macedo, G",
    "title": "DOP089 shaping the future of IBD diagnostics: A multicentric AI-driven capsule endoscopy study"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024-vq",
    "note": "(<strong>FI: 1.000</strong>)",
    "url": "https://doi.org/10.1159/000539837",
    "doi": "10.1159/000539837",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
    "keywords": "Artificial intelligence; Capsule endoscopy; Deep learning; Panendoscopy",
    "year": "<strong>2024</strong>",
    "month": "December",
    "pages": "408–418",
    "number": "6",
    "volume": "31",
    "publisher": "S. Karger AG",
    "journal": "GE Port. J. Gastroenterol.",
    "author": "Mascarenhas, Miguel and Mendes, Francisco and Ribeiro, Tiago and Afonso, João and Marı́lio Cardoso, Pedro and Martins, Miguel and Cardoso, Hélder and Andrade, Patŗ́ia and <strong>Ferreira, João</strong> and Mascarenhas Saraiva, Miguel and Macedo, Guilherme",
    "title": "Deep learning and minimally invasive endoscopy: Panendoscopic detection of pleomorphic lesions"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024aaaaaaa232333",
    "note": "(<strong>FI: 4.500</strong>)",
    "pages": "3540",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mascarenhas, Miguel and Alencoão, Inês and Carinhas, Maria João and Martins, Miguel and Ribeiro, Tiago and Mendes, Francisco and Cardoso, Pedro and Almeida, Maria João and Mota, Joana and Fernandes, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme and Mascarenhas, Teresa and Zulmira, Rosa",
    "publisher": "MDPI AG",
    "journal": "Cancers",
    "number": "20",
    "doi": "10.3390/cancers16203540",
    "url": "http://dx.doi.org/10.3390/cancers16203540",
    "issn": "2072-6694",
    "volume": "16",
    "title": "Artificial Intelligence and Colposcopy: Automatic Identification of Vaginal Squamous Cell Carcinoma Precursors"
  },
  {
    "type": "article",
    "key": "Mota2024-qq",
    "note": "(<strong>FI: 3.000</strong>)",
    "doi": "10.3390/diagnostics14182072",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2024</strong>",
    "month": "September",
    "pages": "2072",
    "number": "18",
    "volume": "14",
    "publisher": "MDPI AG",
    "journal": "Diagnostics (Basel)",
    "author": "Mota, Joana and João Almeida, Maria and Mendes, Francisco and Martins, Miguel and Ribeiro, Tiago and Afonso, João and Cardoso, Pedro and Cardoso, Helder and Andrade, Patricia and <strong>Ferreira, João</strong> and Macedo, Guilherme and Mascarenhas, Miguel",
    "title": "A comprehensive review of artificial intelligence and colon capsule endoscopy: Opportunities and challenges"
  },
  {
    "type": "article",
    "key": "Moura2024-xd",
    "note": "(<strong>FI: 7.500</strong>)",
    "doi": "10.1016/j.eswa.2024.123953",
    "language": "en",
    "copyright": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
    "year": "<strong>2024</strong>",
    "month": "September",
    "pages": "123953",
    "number": "123953",
    "volume": "250",
    "publisher": "Elsevier BV",
    "journal": "Expert Syst. Appl.",
    "author": "Moura, Rita and Oliveira, Dulce A and <strong>Ferreira, João P S</strong> and Parente, Marco P L and Kimmich, Nina and Natal Jorge, Renato M",
    "title": "A finite element-based machine learning framework to predict the mechanical behavior of the pelvic floor muscles during childbirth"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024-dm",
    "note": "(<strong>FI: 3.000</strong>)",
    "doi": "10.3390/jcm13103003",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "keywords": "HSIL; LSIL; artificial intelligence; cervical squamous cell carcinoma; colposcopy",
    "year": "<strong>2024</strong>",
    "month": "May",
    "pages": "3003",
    "number": "10",
    "volume": "13",
    "publisher": "MDPI AG",
    "journal": "J. Clin. Med.",
    "author": "Mascarenhas, Miguel and Alencoão, Inês and Carinhas, Maria João and Martins, Miguel and Cardoso, Pedro and Mendes, Francisco and Fernandes, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme and Zulmira Macedo, Rosa",
    "title": "Artificial intelligence and colposcopy: Automatic identification of cervical squamous cell carcinoma precursors"
  },
  {
    "type": "article",
    "key": "Saraiva2024-pa",
    "note": "(<strong>FI: 4.500</strong>)",
    "doi": "10.3390/cancers16101909",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "keywords": "anal squamous cell carcinoma; high-grade squamous intraepithelial lesion; high-resolution anoscopy; low-grade squamous intraepithelial lesion",
    "year": "<strong>2024</strong>",
    "month": "May",
    "pages": "1909",
    "number": "10",
    "volume": "16",
    "publisher": "MDPI AG",
    "journal": "Cancers (Basel)",
    "author": "Saraiva, Miguel Mascarenhas and Spindler, Lucas and Manzione, Thiago and Ribeiro, Tiago and Fathallah, Nadia and Martins, Miguel and Cardoso, Pedro and Mendes, Francisco and Fernandes, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme and Nadal, Sidney and de Parades, Vincent",
    "title": "Deep learning and high-resolution anoscopy: Development of an interoperable algorithm for the detection and differentiation of anal squamous cell carcinoma precursors-A multicentric study"
  },
  {
    "type": "article",
    "key": "Cardoso2024-hr",
    "note": "(<strong>FI: 3.900</strong>)",
    "doi": "10.1177/17562848241251569",
    "language": "en",
    "keywords": "Crohn's disease; artificial intelligence; capsule endoscopy; inflammatory bowel disease; panendoscopy inflammatory assessment",
    "year": "<strong>2024</strong>",
    "month": "May",
    "pages": "17562848241251569",
    "volume": "17",
    "publisher": "SAGE Publications",
    "journal": "Therap. Adv. Gastroenterol.",
    "author": "Cardoso, Pedro and Mascarenhas, Miguel and Afonso, João and Ribeiro, Tiago and Mendes, Francisco and Martins, Miguel and Andrade, Patrı́cia and Cardoso, Hélder and Mascarenhas Saraiva, Miguel and <strong>Ferreira, João P S</strong> and Macedo, Guilherme",
    "title": "Deep learning and minimally invasive inflammatory activity assessment: a proof-of-concept study for development and score correlation of a panendoscopy convolutional network"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024-ue",
    "note": "(<strong>FI: 2.200</strong>)",
    "doi": "10.1055/a-2236-7849",
    "language": "en",
    "keywords": "Endoscopy Lower GI Tract; Endoscopy Upper GI Tract; Lower GI bleeding; Non-variceal bleeding; Small bowel endoscopy; Small intestinal bleeding",
    "year": "<strong>2024</strong>",
    "month": "April",
    "pages": "E570–E578",
    "number": "4",
    "volume": "12",
    "journal": "Endosc. Int. Open",
    "author": "Mascarenhas, Miguel and Martins, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Franscisco and Andrade, Patrı́cia and Cardoso, Helder and Mascarenhas-Saraiva, Miguel and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Deep learning and capsule endoscopy: Automatic multi-brand and multi-device panendoscopic detection of vascular lesions"
  },
  {
    "type": "article",
    "key": "app14062376",
    "note": "(<strong>FI: 2.700</strong>)",
    "doi": "10.3390/app14062376",
    "abstract": "Atomic force microscopy (AFM) is a powerful technique to study the nanomechanical properties of a wide range of materials at the piconewton level. AFM force–indentation curves can be fitted with appropriate contact models, enabling the determination of material properties for a given sample. However, the analysis of large datasets comprising thousands of curves using conventional methods presents a time-intensive challenge. As a result, there is an increasing interest in exploring alternative methodologies, such as integrating machine learning (ML) models to streamline and improve the efficiency of this process. In this work, two data-driven regressors were tuned to predict the Young’s modulus and adhesion energy from force–indentation curves of soft samples (Young’s modulus up to 10 kPa). Both models were trained exclusively on synthetic data derived from the contact theories developed by Hertz as well as Johnson, Kendall and Roberts (JKR). The PyTorch library was employed to build and train the models; then, the key hyperparameters were refined by implementing the optimization framework Optuna. The first model was successfully tested with synthetic and experimental curves from AFM nanoindentations, and the second presented promising results on the synthetic data. Our work suggests that experimental data may not be essential for training data-driven models to predict surface properties from AFM nanoindentations. By delivering accurate predictions in a computationally efficient way, our regressors validate the potential of a deep learning approach in exploring AFM nanoindentations and motivate further development of similar strategies to overcome current limitations in AFM postprocessing.",
    "issn": "2076-3417",
    "url": "https://www.mdpi.com/2076-3417/14/6/2376",
    "article-number": "2376",
    "number": "6",
    "year": "<strong>2024</strong>",
    "volume": "14",
    "journal": "Applied Sciences",
    "title": "Deep Learning Regressors of Surface Properties from Atomic Force Microscopy Nanoindentations",
    "author": "Pacheco, Luís R. L. and <strong>Ferreira, João P. S.</strong> and Parente, Marco P. L."
  },
  {
    "type": "article",
    "key": "mota2024data",
    "note": "(<strong>FI: 3.600</strong>)",
    "url": "https://www.mdpi.com/2075-4418/14/3/291",
    "doi": "https://doi.org/10.3390/diagnostics14030291",
    "publisher": "MDPI",
    "year": "<strong>2024</strong>",
    "pages": "291",
    "number": "3",
    "volume": "14",
    "journal": "Diagnostics",
    "author": "Mota, Joana and Almeida, Maria João and Mendes, Francisco and Martins, Miguel and Ribeiro, Tiago and Afonso, João and Cardoso, Pedro and Cardoso, Helder and Andrade, Patrı́cia and <strong>Ferreira, João</strong> and others",
    "title": "From Data to Insights: How Is AI Revolutionizing Small-Bowel Endoscopy?"
  },
  {
    "type": "article",
    "key": "mascarenhas2024deep",
    "note": "(<strong>FI: 2.600</strong>)",
    "url": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-2236-7849",
    "doi": "https://doi.org/10.1055/a-2236-7849",
    "publisher": "Georg Thieme Verlag KG",
    "year": "<strong>2024</strong>",
    "journal": "Endoscopy International Open",
    "author": "Mascarenhas, Miguel and Martins, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Franscisco and Andrade, Patrı́cia and Cardoso, Helder and Mascarenhas-Saraiva, Miguel and <strong>Ferreira, João</strong>",
    "title": "Deep Learning and Capsule Endoscopy: Automatic Multi-brand and Multi-device Panendoscopic Detection of Vascular Lesions"
  },
  {
    "type": "article",
    "key": "mendes2024artificial",
    "note": "(<strong>FI: 5.200</strong>)",
    "url": "https://www.mdpi.com/2072-6694/16/1/208",
    "doi": "https://doi.org/10.3390/cancers16010208",
    "publisher": "MDPI",
    "year": "<strong>2024</strong>",
    "pages": "208",
    "number": "1",
    "volume": "16",
    "journal": "Cancers",
    "author": "Mendes, Francisco and Mascarenhas, Miguel and Ribeiro, Tiago and Afonso, João and Cardoso, Pedro and Martins, Miguel and Cardoso, Hélder and Andrade, Patrı́cia and <strong>Ferreira, João</strong> PS and Mascarenhas Saraiva, Miguel and others",
    "title": "Artificial Intelligence and Panendoscopy—Automatic Detection of Clinically Relevant Lesions in Multibrand Device-Assisted Enteroscopy"
  },
  {
    "type": "article",
    "key": "01720094-990000000-00229",
    "note": "(<strong>FI: 4.396</strong>)",
    "url": "https://journals.lww.com/ctg/fulltext/9900/deep_learning_in_high_resolution_anoscopy_.229.aspx",
    "doi": "https://doi.org/10.14309/ctg.0000000000000681",
    "issn": "2155-384X",
    "keywords": "anal squamous cell carcinoma; high-resolution anoscopy; artificial intelligence; HSIL; LSIL",
    "year": "<strong>2024</strong>",
    "journal": "Clinical and Translational Gastroenterology",
    "title": "Deep Learning in High-Resolution Anoscopy: Assessing the Impact of Staining and Therapeutic Manipulation on Automated Detection of Anal Cancer Precursors",
    "author": "Saraiva, Miguel Mascarenhas and Spindler, Lucas and Fathallah, Nadia and Beaussier, Hélene and Mamma, Célia and Quesnée, Mathilde and Ribeiro, Tiago and Afonso, João and Carvalho, Mariana and Moura, Rita and Andrade, Patrícia and Cardoso, Hélder and Adam, Julien and <strong>Ferreira, João</strong> and Macedo, Guilherme and de Parades, Vincent"
  },
  {
    "type": "article",
    "key": "pouca2024simulating",
    "note": "(<strong>FI: 4.600</strong>)",
    "url": "https://www.sciencedirect.com/science/article/pii/S0168874X23001919",
    "doi": "https://doi.org/10.1016/j.finel.2023.104098",
    "publisher": "Elsevier",
    "year": "<strong>2024</strong>",
    "pages": "104098",
    "volume": "230",
    "journal": "Finite Elements in Analysis and Design",
    "author": "Pouca, MCP Vila and Cerqueira, MRG and <strong>Ferreira, JPS</strong> and Darabi, R and Ramião, NAG and Sobreiro-Almeida, R and Castro, APG and Fernandes, PR and Mano, JF and Jorge, RM Natal and others",
    "title": "Simulating 3D printing on hydrogel inks: A finite element framework for predicting mechanical properties and scaffold deformation"
  },
  {
    "type": "article",
    "key": "Martins2024-xo",
    "doi": "10.1055/s-0045-1808894",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2024</strong>",
    "month": "December",
    "pages": "S1–S138",
    "number": "S 01",
    "volume": "44",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "J. Coloproctology",
    "author": "Martins, Miguel and Mascarenhas, Miguel and Mendes, Francisco and Mota, Joana and Cordeiro, João and <strong>Ferreira, João</strong> and Santander, Cecı́lio and Macedo, Guilherme",
    "title": "Artificial intelligence as a transformative factor in motility disorders – automatic detection of motility patterns in high-resolution anorectal manometry"
  },
  {
    "type": "article",
    "key": "Cardoso2024-tm",
    "doi": "10.1055/s-0045-1808886",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2024</strong>",
    "month": "December",
    "pages": "S1–S138",
    "number": "S 01",
    "volume": "44",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "J. Coloproctology",
    "author": "Cardoso, Pedro and Mascarenhas, Miguel and Almeida, Maria João and Martins, Miguel and Mendes, Francisco and Cardoso, Hélder and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Deep learning and capsule endoscopy: Automatic multi-brand panendoscopic detection of vascular lesions"
  },
  {
    "type": "article",
    "key": "Almeida2024-zb",
    "doi": "10.1055/s-0045-1808877",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2024</strong>",
    "month": "December",
    "pages": "S1–S138",
    "number": "S 01",
    "volume": "44",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "J. Coloproctology",
    "author": "Almeida, Maria João and Mascarenhas, Miguel and Cardoso, Pedro and Afonso, João and Ribeiro, Tiago and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Artificial intelligence and minimally invasive assessment of inflammatory activity: A study on the development and correlation of indices with a convolutional neural network model in panendoscopy"
  },
  {
    "type": "article",
    "key": "Manzione2024-ux",
    "doi": "10.1055/s-0045-1808860",
    "language": "en",
    "copyright": "https://creativecommons.org/licenses/by/4.0/",
    "year": "<strong>2024</strong>",
    "month": "December",
    "pages": "S1–S138",
    "number": "S 01",
    "volume": "44",
    "publisher": "Georg Thieme Verlag KG",
    "journal": "J. Coloproctology",
    "author": "Manzione, Thiago da Silveira and Saraiva, Miguel Mascarenhas and Spindler, Lucas and Barroso, Luis and Martins, Miguel and de Paredes, Vincent and <strong>Ferreira, João</strong> and Nadal, Sidney Roberto",
    "title": "Artificial intelligence and high-resolution anoscopy: Development of an interoperable model for the detection and differentiation of precusors of squamous cell carcinoma of the anal canal – a transatlantic multicenter study"
  },
  {
    "type": "article",
    "key": "Mendes2024asdfg5",
    "doi": "10.14309/01.ajg.0001028372.84020.0d",
    "pages": "S1–S1",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mendes, Francisco and Mascarenhas, Miguel and Widmer, Jessica and González-Haba, Mariano and Gonda, Tamas and Agudo, Belen and Ribeiro, Tiago and Martins, Miguel and Almeida, Maria joão and Pinto da Costa, Antonio and Fazel, Yousef and Lera dos Santos, Marcos Eduardo and Horneaux de Moura, Eduardo and Bestetti, Alexandre and Boas, Filipe Vilas and Ribeiro, Pedro Moutinho and Lopes, Susana and Fernandes, Joana and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "American Journal of Gastroenterology",
    "number": "10S",
    "url": "http://dx.doi.org/10.14309/01.ajg.0001028372.84020.0d",
    "issn": "1572-0241",
    "volume": "119",
    "title": "S1 Artificial Intelligence-Driven Endoscopic Ultrasound for Detection and Differentiation of Pleomorphic Pancreatic Lesions: A Transatlantic Study"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024asd23hnjk",
    "doi": "10.14309/01.ajg.0001028376.47767.fe",
    "pages": "S1–S2",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mascarenhas, Miguel and Widmer, Jessica and González-Haba, Mariano and Mendes, Francisco and Gonda, Tamas and Agudo, Belen and Ribeiro, Tiago and Martins, Miguel and Pinto da Costa, Antonio and Fazel, Yousef and Lera dos Santos, Marcos Eduardo and Horneaux de Moura, Eduardo and Boas, Filipe Vilas and Pereira, Pedro and Mendes, Bruno and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "American Journal of Gastroenterology",
    "number": "10S",
    "url": "http://dx.doi.org/10.14309/01.ajg.0001028376.47767.fe",
    "issn": "1572-0241",
    "volume": "119",
    "title": "S2 Artificial Intelligence-Assisted Digital Cholangioscopy for the Diagnosis and Morphological Characterization of Indeterminate Biliary Strictures: A Multicentric Study"
  },
  {
    "type": "article",
    "key": "Mascarenhas202408765",
    "doi": "10.14309/01.ajg.0001038376.23171.50",
    "pages": "S1608–S1609",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mascarenhas, Miguel and Almeida, Maria João and Martins, Miguel and Mendes, Francisco and Afonso, Joao and Ribeiro, Tiago and Cardoso, Pedro and Mota, Joana and Andrade, Patricia and Cardoso, Helder and <strong>Ferreira, João</strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "American Journal of Gastroenterology",
    "number": "10S",
    "url": "http://dx.doi.org/10.14309/01.ajg.0001038376.23171.50",
    "issn": "1572-0241",
    "volume": "119",
    "title": "S2252 Deep Learning and Capsule Endoscopy: Automatic Panendoscopic Detection of Pleomorphic Protruding Lesions"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024756367",
    "doi": "10.14309/01.ajg.0001030736.76025.d9",
    "pages": "S241–S241",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mascarenhas, Miguel and Barroso, Luis and Spindler, Lucas and Manzione, Thiago and Martins, Miguel and Fathallah, Nadia and Ribeiro, Tiago and Cardoso, Pedro and <strong>Ferreira, João</strong> and Nadal, Sidney and Macedo, Guilherme and de Parades, Vincent",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "American Journal of Gastroenterology",
    "number": "10S",
    "url": "http://dx.doi.org/10.14309/01.ajg.0001030736.76025.d9",
    "issn": "1572-0241",
    "volume": "119",
    "title": "S342 Interoperable Artificial Intelligence for High-Resolution Anoscopy: A Transatlantic Collaborative Study in Anal Cancer Precursor Detection and Differentiation"
  },
  {
    "type": "article",
    "key": "Mascarenhas2024jhedrtt",
    "doi": "10.14309/01.ajg.0001032620.14140.41",
    "pages": "S558–S558",
    "month": "October",
    "year": "<strong>2024</strong>",
    "author": "Mascarenhas, Miguel and Mendes, Francisco and Mota, Joana and Ribeiro, Tiago and Cardoso, Pedro and Martins, Miguel and El Hajra Martinez, Ismael and Royo, Virginia Matallana and Pinto da Costa, Antonio and Cordeiro, Joao and <strong>Ferreira, João</strong> and Macedo, Guilherme and Santander, Cecilio",
    "publisher": "Ovid Technologies (Wolters Kluwer Health)",
    "journal": "American Journal of Gastroenterology",
    "number": "10S",
    "url": "http://dx.doi.org/10.14309/01.ajg.0001032620.14140.41",
    "issn": "1572-0241",
    "volume": "119",
    "title": "S813 Artificial Intelligence as a Transforming Factor in Motility Disorders - Automatic Detection and Differentiation of Motility Patterns in High-Resolution Anorectal Manometry"
  },
  {
    "type": "article",
    "key": "Ribeiro2024-bb",
    "doi": "https://doi.org/10.1016/S0016-5085(24)03857-5",
    "language": "en",
    "year": "<strong>2024</strong>",
    "month": "May",
    "pages": "S–1486",
    "number": "5",
    "volume": "166",
    "publisher": "Elsevier BV",
    "journal": "Gastroenterology",
    "author": "Ribeiro, Tiago F and Saraiva, Miguel M and Afonso, João and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and Andrade, Patrı́cia and Cardoso, Hélder and <strong>Ferreira, João</strong> and Saraiva, Miguel and Macedo, Guilherme",
    "title": "Tu2000 deep learning and minimally invasive endoscopy – panendoscopic detection of pleomorphic lesions"
  },
  {
    "type": "article",
    "key": "Saraiva2024-cm",
    "doi": "https://doi.org/10.1016/S0016-5085(24)02726-4",
    "language": "en",
    "year": "<strong>2024</strong>",
    "month": "May",
    "pages": "S–979",
    "number": "5",
    "volume": "166",
    "publisher": "Elsevier BV",
    "journal": "Gastroenterology",
    "author": "Saraiva, Miguel M and Spindler, Lucas and Manzione, Thiago and Fathallah, Nadia and Ribeiro, Tiago F and Afonso, João and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and <strong>Ferreira, João</strong> and Macedo, Guilherme and Nadal, Sidney R and de Parades, Vincent",
    "title": "Mo1207 deep learning and high-resolution anoscopy: development of an interoperable artificial intelligence model for the detection and differentiation of anal squamous cell carcinoma precursors – A multicentric study"
  },
  {
    "type": "article",
    "key": "Saraiva2024-vk",
    "doi": "https://doi.org/10.1016/j.gie.2024.04.671",
    "language": "en",
    "year": "<strong>2024</strong>",
    "month": "June",
    "pages": "AB20–AB21",
    "number": "6",
    "volume": "99",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel and Widmer, Jessica and Haba, Mariano Gonzalez and Ribeiro, Tiago and Agudo, Belen and Manvar, Amar and Fazel, Yousef and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and <strong>Ferreira, João</strong> and Boas, Filipe Vilas and Pereira, Pedro and Macedo, Guilherme",
    "title": "Artificial intelligence for automatic diagnosis and pleomorphic morphologic characterization of malignant biliary strictures using digital cholangioscopy: A multicentric transatlantic study"
  },
  {
    "type": "article",
    "key": "Saraiva2024-wf",
    "doi": "https://doi.org/10.1016/j.gie.2024.04.650",
    "language": "en",
    "year": "<strong>2024</strong>",
    "month": "June",
    "pages": "AB8",
    "number": "6",
    "volume": "99",
    "publisher": "Elsevier BV",
    "journal": "Gastrointest. Endosc.",
    "author": "Saraiva, Miguel and Agudo, Belen and Haba, Mariano Gonzalez and Ribeiro, Tiago and Afonso, João and Pinto da Costa, Antonio and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and <strong>Ferreira, João</strong> and Boas, Filipe Vilas and Macedo, Guilherme",
    "title": "Deep learning and endoscopic ultrasound: Automatic detection and characterization of cystic and solid pancreatic lesions – a multicentric study"
  },
  {
    "type": "inproceedings",
    "key": "Ribeiro2024-gv",
    "doi": "https://doi.org/10.1055/s-0044-1782892",
    "location": "Berlin, Germany",
    "conference": "ESGE Days 2024",
    "year": "<strong>2024</strong>",
    "month": "April",
    "publisher": "Georg Thieme Verlag KG",
    "author": "Ribeiro, T and Mascarenhas, M and Afonso, J P and Martins, M and Francisco, M and Pedro, C and <strong>Ferreira, J</strong> and Agudo, B and Ruiz, M González-Haba and Vilas-Boas, F and Guilherme, M",
    "booktitle": "ESGE Days 2024",
    "title": "Automatic differentiation of solid pancreatic lesions in Endoscopic Ultrasound using – a multicentre study"
  },
  {
    "type": "inproceedings",
    "key": "Agudo2024-jy",
    "doi": "https://doi.org/10.1055/s-0044-1782748",
    "location": "Berlin, Germany",
    "conference": "ESGE Days 2024",
    "year": "<strong>2024</strong>",
    "month": "April",
    "publisher": "Georg Thieme Verlag KG",
    "author": "Agudo, B and Mascarenhas, M and Ruiz, M González-Haba and Ribeiro, T and <strong>Ferreira, J</strong> and Afonso, J P and Francisco, M and Martins, M and Pedro, C and Vilas Boas, F and Guilherme, M",
    "booktitle": "ESGE Days 2024",
    "title": "A multicenter approach for the development of an artificial intelligence algorithm for the evaluation of pancreatic cystic lesions during endoscopic ultrasound"
  },
  {
    "type": "inproceedings",
    "key": "Ruiz2024-lz",
    "doi": "https://doi.org/10.1055/s-0044-1782946",
    "location": "Berlin, Germany",
    "conference": "ESGE Days 2024",
    "year": "<strong>2024</strong>",
    "month": "April",
    "publisher": "Georg Thieme Verlag KG",
    "author": "Ruiz, M González-Haba and Mascarenhas, M and Widmer, J and Agudo, B and Ribeiro, T and Afonso, J P and Francisco, M and Martins, M and Pedro, C and Boas, F Vilas and <strong>Ferreira, J</strong> and Guilherme, M",
    "booktitle": "ESGE Days 2024",
    "title": "Artificial intelligence for automatic diagnosis and pleomorphic morphologic characterization of malignant biliary strictures using digital cholangioscopy: A multicentric transatlantic study"
  },
  {
    "type": "article",
    "key": "cardoso2024p201",
    "url": "https://academic.oup.com/ecco-jcc/article/18/Supplement_1/i520/7586418",
    "doi": "https://doi.org/10.1093/ecco-jcc/jjad212.0331",
    "publisher": "Oxford University Press UK",
    "year": "<strong>2024</strong>",
    "pages": "i520–i521",
    "number": "Supplement_1",
    "volume": "18",
    "journal": "Journal of Crohn's and Colitis",
    "author": "Cardoso, P and Mascarenhas, M and Afonso, J and Ribeiro, T and Mendes, F and Martins, M and Andrade, P and Cardoso, H and Mascarenhas Saraiva, M and <strong>Ferreira, J</strong> and Lopes, S and Macedo, G",
    "title": "P201 Deep learning and minimally invasive inflammatory activity assessment: development and score correlation of a pan endoscopy convolutional network"
  },
  {
    "type": "article",
    "key": "mendes2024p469",
    "url": "https://academic.oup.com/ecco-jcc/article/18/Supplement_1/i942/7586589",
    "doi": "https://doi.org/10.1093/ecco-jcc/jjad212.0599",
    "publisher": "Oxford University Press UK",
    "year": "<strong>2024</strong>",
    "pages": "i942–i943",
    "number": "Supplement_1",
    "volume": "18",
    "journal": "Journal of Crohn's and Colitis",
    "author": "Mendes, F and Mascarenhas, M and Ribeiro, T and Afonso, J and Cardoso, P and Martins, M and Cardoso, H and Andrade, P and Mascarenhas Saraiva, M and <strong>Ferreira, J</strong> and others",
    "title": "P469 Deep learning and minimally invasive endoscopy–panendoscopic detection of pleomorphic lesions"
  },
  {
    "type": "article",
    "key": "cardoso0331a",
    "url": "https://academic.oup.com/ecco-jcc/article-pdf/18/Supplement_1/i520/56348564/jjad212.0331.pdf",
    "doi": "https://doi.org/10.1093/ecco-jcc/jjad212.0331",
    "publisher": "Oxford University Press UK",
    "year": "<strong>2024</strong>",
    "pages": "i520–i521",
    "number": "Supplement_1",
    "volume": "18",
    "journal": "Journal of Crohns and Colitis",
    "title": "P201 Deep learning and minimally invasive inflammatory activity assessment: development and score correlation of a pan endoscopy convolutional network",
    "author": "Cardoso, P and Mascarenhas, M and Afonso, J and Ribeiro, T and Mendes, F and Martins, M and Andrade, P and Cardoso, H and Mascarenhas Saraiva, M and <strong>Ferreira, J</strong> and Lopes, S and Macedo, G"
  },
  {
    "type": "article",
    "key": "araujo2024p268",
    "url": "https://academic.oup.com/ecco-jcc/article/18/Supplement_1/i631/7586265",
    "doi": "https://doi.org/10.1093/ecco-jcc/jjad212.0398",
    "publisher": "Oxford University Press UK",
    "year": "<strong>2024</strong>",
    "pages": "i631–i632",
    "number": "Supplement_1",
    "volume": "18",
    "journal": "Journal of Crohn's and Colitis",
    "author": "Araújo Martins, MP and Mascarenhas, M and Afonso, J and Ribeiro, T and Cardoso, P and Mendes, F and Cardoso, H and Andrande, P and Mascarenhas Saraiva, M and <strong>Ferreira, J</strong> and others",
    "title": "P268 Artificial Intelligence and Panendoscopy - Automatic Detection of Pleomorphic Lesions in Multibrand Device-Assisted Enteroscopy"
  },
  {
    "type": "article",
    "key": "mascarenhas2023ai",
    "note": "(<strong>FI: 3.600</strong>)",
    "url": "https://www.mdpi.com/2075-4418/13/23/3494",
    "doi": "https://doi.org/10.3390/diagnostics13233494",
    "publisher": "MDPI",
    "year": "<strong>2023</strong>",
    "pages": "3494",
    "number": "23",
    "volume": "13",
    "journal": "Diagnostics",
    "author": "Mascarenhas Saraiva, Miguel José and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and Andrade, Ana Patrı́cia and Cardoso, Hélder and Mascarenhas Saraiva, Miguel and <strong>Ferreira, João</strong>",
    "title": "AI-Driven Colon Cleansing Evaluation in Capsule Endoscopy: A Deep Learning Approach"
  },
  {
    "type": "article",
    "key": "mascarenhas2023future",
    "note": "(<strong>FI: 5.600</strong>)",
    "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10742312/",
    "doi": "https://doi.org/10.3390/cancers15245861",
    "publisher": "MDPI",
    "year": "<strong>2023</strong>",
    "pages": "5861",
    "number": "24",
    "volume": "15",
    "journal": "Cancers",
    "author": "Mascarenhas, Miguel and Martins, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Andrade, Patrı́cia and Cardoso, Helder and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "The Future of Minimally Invasive Capsule Panendoscopy: Robotic Precision, Wireless Imaging and AI-Driven Insights"
  },
  {
    "type": "article",
    "key": "mascarenhas2023smart",
    "note": "(<strong>FI: 3.600</strong>)",
    "url": "https://www.mdpi.com/2075-4418/13/24/3625",
    "doi": "https://doi.org/10.3390/diagnostics13243625",
    "publisher": "MDPI",
    "year": "<strong>2023</strong>",
    "pages": "3625",
    "number": "24",
    "volume": "13",
    "journal": "Diagnostics",
    "author": "Mascarenhas, Miguel and Ribeiro, Tiago and Afonso, João and Mendes, Francisco and Cardoso, Pedro and Martins, Miguel and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "Smart Endoscopy Is Greener Endoscopy: Leveraging Artificial Intelligence and Blockchain Technologies to Drive Sustainability in Digestive Health Care"
  },
  {
    "type": "article",
    "key": "saraiva2023artificial",
    "note": "(<strong>FI: 4.396</strong>)",
    "url": "https://journals.lww.com/ctg/fulltext/2023/10000/artificial_intelligence_and_anorectal_manometry_.9.aspx",
    "doi": "https://doi.org/10.14309/ctg.0000000000000555",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "e00555",
    "number": "10",
    "volume": "14",
    "journal": "Clinical and Translational Gastroenterology",
    "author": "Saraiva, Miguel Mascarenhas and Pouca, Maria Vila and Ribeiro, Tiago and Afonso, João and Cardoso, Hélder and Sousa, Pedro and <strong>Ferreira, João</strong> and Macedo, Guilherme and Junior, Ilario Froehner",
    "title": "Artificial Intelligence and Anorectal Manometry: Automatic Detection and Differentiation of Anorectal Motility Patterns—A Proof-of-Concept Study"
  },
  {
    "type": "article",
    "key": "saraiva2023deep",
    "note": "(<strong>FI: 5.200</strong>)",
    "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10571941/",
    "doi": "https://doi.org/10.3390/cancers15194827",
    "publisher": "MDPI",
    "year": "<strong>2023</strong>",
    "pages": "4827",
    "number": "19",
    "volume": "15",
    "journal": "Cancers",
    "author": "Saraiva, Miguel Mascarenhas and Ribeiro, Tiago and González-Haba, Mariano and Agudo Castillo, Belén and <strong>Ferreira, João</strong> PS and Vilas Boas, Filipe and Afonso, João and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and others",
    "title": "Deep Learning for Automatic Diagnosis and Morphologic Characterization of Malignant Biliary Strictures Using Digital Cholangioscopy: A Multicentric Study"
  },
  {
    "type": "article",
    "key": "rocha2023",
    "note": "(<strong>FI: 3.405</strong>)",
    "year": "<strong>2023</strong>",
    "abstract": "Abstract Tissue engineering uses cells and biomaterials to develop bioartificial tissue substitutes for different purposes. For example, although several skin models have been developed for pharmaceutical and cosmetic research and skin wound healing, there are few studies on 3D cultures of keratinocytes in 3D printed scaffolds. So, this work aimed to develop a 3D-printed hydrogel scaffold to promote human keratinocyte growth. Mesh 3D scaffolds were printed using an extrusion-based method with a 20% gelatin/5% alginate hydrogel, where HaCaT cells were cultured for 7 days. Scaffolds kept their structure for over 1 week, and their stiffness only decreased after 7 days, showing good mechanical and structural characteristics and biodegradability (27% weight lost). Viable keratinocytes (MTT assay) are aggregated into spheroids, a 3D model capable of mimicking in vivo cell properties and phenotypes. Spheroids were formed on 47% of scaffolds pores and grew over time, showing promising cell proliferation. F-actin staining showed cells' irregular and interconnected shapes and organization over time. This method offers an easy and inexpensive solution for keratinocyte spheroid formation, which may be helpful in tissue engineering as a cell delivery system, for pharmacological or basic research, or wound healing medical applications.",
    "eprint": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/jbm.b.35216",
    "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jbm.b.35216",
    "doi": "https://doi.org/10.1002/jbm.b.35216",
    "keywords": "alginate, biomaterials, gelatin, HaCaT, regeneration, skin, tissue engineering, wound healing",
    "pages": "1089-1099",
    "number": "5",
    "volume": "111",
    "journal": "Journal of Biomedical Materials Research Part B: Applied Biomaterials",
    "title": "A 3D printed hydrogel to promote human keratinocytes' spheroid-based growth",
    "author": "Rocha, Tânia and Teixeira, Ana Margarida and Gomes, Susana G. and André, António and Martins, Pedro and <strong>Ferreira, João</strong> and Negrão, Rita"
  },
  {
    "type": "article",
    "key": "medicina59040810",
    "note": "(<strong>FI: 2.948</strong>)",
    "doi": "10.3390/medicina59040810",
    "abstract": "Background and objectives: Capsule endoscopy (CE) is a non-invasive method to inspect the small bowel that, like other enteroscopy methods, requires adequate small-bowel cleansing to obtain conclusive results. Artificial intelligence (AI) algorithms have been seen to offer important benefits in the field of medical imaging over recent years, particularly through the adaptation of convolutional neural networks (CNNs) to achieve more efficient image analysis. Here, we aimed to develop a deep learning model that uses a CNN to automatically classify the quality of intestinal preparation in CE. Methods: A CNN was designed based on 12,950 CE images obtained at two clinical centers in Porto (Portugal). The quality of the intestinal preparation was classified for each image as: excellent, &ge;90% of the image surface with visible mucosa; satisfactory, 50&ndash;90% of the mucosa visible; and unsatisfactory, &lt;50% of the mucosa visible. The total set of images was divided in an 80:20 ratio to establish training and validation datasets, respectively. The CNN prediction was compared with the classification established by consensus of a group of three experts in CE, currently considered the gold standard to evaluate cleanliness. Subsequently, how the CNN performed in diagnostic terms was evaluated using an independent validation dataset. Results: Among the images obtained, 3633 were designated as unsatisfactory preparation, 6005 satisfactory preparation, and 3312 with excellent preparation. When differentiating the classes of small-bowel preparation, the algorithm developed here achieved an overall accuracy of 92.1%, with a sensitivity of 88.4%, a specificity of 93.6%, a positive predictive value of 88.5%, and a negative predictive value of 93.4%. The area under the curve for the detection of excellent, satisfactory, and unsatisfactory classes was 0.98, 0.95, and 0.99, respectively. Conclusions: A CNN-based tool was developed to automatically classify small-bowel preparation for CE, and it was seen to accurately classify intestinal preparation for CE. The development of such a system could enhance the reproducibility of the scales used for such purposes.",
    "issn": "1648-9144",
    "pubmedid": "37109768",
    "url": "https://www.mdpi.com/1648-9144/59/4/810",
    "article-number": "810",
    "number": "4",
    "year": "<strong>2023</strong>",
    "volume": "59",
    "journal": "Medicina",
    "title": "Design of a Convolutional Neural Network as a Deep Learning Tool for the Automatic Classification of Small-Bowel Cleansing in Capsule Endoscopy",
    "author": "Ribeiro, Tiago and Mascarenhas Saraiva, Miguel José and Afonso, João and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and Andrade, Ana Patrícia and Cardoso, Hélder and Mascarenhas Saraiva, Miguel and <strong>Ferreira, João</strong> and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "medicina59010172",
    "note": "(<strong>FI: 2.948</strong>)",
    "url": "https://www.mdpi.com/1648-9144/59/1/172",
    "doi": "10.3390/medicina59010172",
    "abstract": "Background and Objectives: Device-assisted enteroscopy (DAE) has a significant role in approaching enteric lesions. Endoscopic observation of ulcers or erosions is frequent and can be associated with many nosological entities, namely Crohn&rsquo;s disease. Although the application of artificial intelligence (AI) is growing exponentially in various imaged-based gastroenterology procedures, there is still a lack of evidence of the AI technical feasibility and clinical applicability of DAE. This study aimed to develop and test a multi-brand convolutional neural network (CNN)-based algorithm for automatically detecting ulcers and erosions in DAE. Materials and Methods: A unicentric retrospective study was conducted for the development of a CNN, based on a total of 250 DAE exams. A total of 6772 images were used, of which 678 were considered ulcers or erosions after double-validation. Data were divided into a training and a validation set, the latter being used for the performance assessment of the model. Our primary outcome measures were sensitivity, specificity, accuracy, positive predictive value (PPV), negative predictive value (NPV), and an area under the curve precision&ndash;recall curve (AUC-PR). Results: Sensitivity, specificity, PPV, and NPV were respectively 88.5%, 99.7%, 96.4%, and 98.9%. The algorithm&rsquo;s accuracy was 98.7%. The AUC-PR was 1.00. The CNN processed 293.6 frames per second, enabling AI live application in a real-life clinical setting in DAE. Conclusion: To the best of our knowledge, this is the first study regarding the automatic multi-brand panendoscopic detection of ulcers and erosions throughout the digestive tract during DAE, overcoming a relevant interoperability challenge. Our results highlight that using a CNN to detect this type of lesion is associated with high overall accuracy. The development of binary CNN for automatically detecting clinically relevant endoscopic findings and assessing endoscopic inflammatory activity are relevant steps toward AI application in digestive endoscopy, particularly for panendoscopic evaluation.",
    "issn": "1648-9144",
    "pubmedid": "36676796",
    "article-number": "172",
    "number": "1",
    "year": "<strong>2023</strong>",
    "volume": "59",
    "journal": "Medicina",
    "title": "Deep-Learning and Device-Assisted Enteroscopy: Automatic Panendoscopic Detection of Ulcers and Erosions",
    "author": "Martins, Miguel and Mascarenhas, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Cardoso, Hélder and Andrade, Patricia and <strong>Ferreira, João P. S.</strong> and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "cancers15020359",
    "note": "(<strong>FI: 6.575</strong>)",
    "doi": "10.3390/cancers15020359",
    "abstract": "Bladder cancer (BlCa), specifically urothelial carcinomas, is a heterogeneous disease that derives from the urothelial lining. Two main classes of BlCa are acknowledged: the non-muscle invasive BlCa and the muscle-invasive BlCa; the latter constituting an aggressive disease which invades locally and metastasizes systemically. Distinguishing the specific microenvironment that cancer cells experience between mucosa and muscularis propria layers can help elucidate how these cells acquire invasive capacities. In this work, we propose to measure the micromechanical properties of both mucosa and muscularis propria layers of the bladder wall of BlCa patients, using atomic force microscopy (AFM). To do that, two cross-sections of both the macroscopically normal urinary bladder wall and the bladder wall adjacent to the tumor were collected and immediately frozen, prior to AFM samples analysis. The respective &ldquo;twin&rdquo; formalin-fixed paraffin-embedded tissue fragments were processed and later evaluated for histopathological examination. H&amp;E staining suggested that tumors promoted the development of muscle-like structures in the mucosa surrounding the neoplastic region. The average Young&rsquo;s modulus (cell stiffness) in tumor-adjacent specimens was significantly higher in the muscularis propria than in the mucosa. Similarly, the tumor-free specimens had significantly higher Young&rsquo;s moduli in the muscularis propria than in the urothelium. Young&rsquo;s moduli were higher in all layers of tumor-adjacent tissues when compared with tumor-free samples. Here we provide insights into the stiffness of the bladder wall layers, and we show that the presence of tumor in the surrounding mucosa leads to an alteration of its smooth muscle content. The quantitative assessment of stiffness range here presented provides essential data for future research on BlCa and for understanding how the biomechanical stimuli can modulate cancer cells&rsquo; capacity to invade through the different bladder layers.",
    "issn": "2072-6694",
    "pubmedid": "36672309",
    "url": "https://www.mdpi.com/2072-6694/15/2/359",
    "article-number": "359",
    "number": "2",
    "year": "<strong>2023</strong>",
    "volume": "15",
    "journal": "Cancers",
    "title": "Bladder Wall Stiffness after Cystectomy in Bladder Cancer Patients: A Preliminary Study",
    "author": "Monteiro-Reis, Sara and <strong>Ferreira, João P. S.</strong> and Pires, Ricardo A. and Lobo, João and Carvalho, João A. and Reis, Rui L. and Jorge, Renato Natal and Jeronimo, Carmen"
  },
  {
    "type": "inbook",
    "key": "AFONSO20231",
    "abstract": "Artificial intelligence (AI), in its various aspects, has revolutionized our world, and the healthcare field is no exception. The search for more effective, faster, and cheaper diagnostic and therapeutic methods has raised the interest in this type of technology, particularly in disciplines highly dependent on image analysis. Gastroenterology is one such area where the impact of AI technologies in clinical practice has been increasingly studied. In this chapter, we intend to explore the impact of AI in our world, with particular emphasis on advances in healthcare and gastroenterology.",
    "keywords": "Artificial intelligence, gastroenterology, capsule endoscopy",
    "author": "João Afonso and Miguel Martins and <strong>Ferreira, João P. S.</strong> and Miguel Mascarenhas",
    "url": "https://www.sciencedirect.com/science/article/pii/B9780323996471000034",
    "doi": "https://doi.org/10.1016/B978-0-323-99647-1.00003-4",
    "isbn": "978-0-323-99647-1",
    "year": "<strong>2023</strong>",
    "pages": "1-10",
    "publisher": "Academic Press",
    "booktitle": "Artificial Intelligence in Capsule Endoscopy",
    "editor": "Miguel Mascarenhas and Hélder Cardoso and Guilherme Macedo",
    "title": "Chapter 1 - Artificial intelligence: machine learning, deep learning, and applications in gastrointestinal endoscopy"
  },
  {
    "type": "article",
    "key": "ribeiro2023deep",
    "url": "https://www.giejournal.org/article/S0016-5107(23)01638-3/abstract",
    "doi": "https://doi.org/10.1016/j.gie.2023.04.1252",
    "publisher": "Elsevier",
    "year": "<strong>2023</strong>",
    "pages": "AB765",
    "number": "6",
    "volume": "97",
    "journal": "Gastrointestinal Endoscopy",
    "author": "Ribeiro, Tiago and Saraiva, Miguel and Afonso, João and Cardoso, Pedro and Cardoso, Hélder and Andrade, Patrı́cia and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "DEEP LEARNING AND CAPSULE ENDOSCOPY: PANENDOSCOPIC CLASSIFICATION OF SMALL BOWEL AND COLON PREPARATION USING A CONVOLUTIONAL NEURAL NETWORK"
  },
  {
    "type": "article",
    "key": "saraiva2023deep",
    "url": "https://www.giejournal.org/article/S0016-5107(23)02258-7/abstract",
    "doi": "https://doi.org/10.1016/j.gie.2023.04.1872",
    "publisher": "Elsevier",
    "year": "<strong>2023</strong>",
    "pages": "AB1240",
    "number": "6",
    "volume": "97",
    "journal": "Gastrointestinal Endoscopy",
    "author": "Saraiva, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Cardoso, Hélder and Andrade, Patrı́cia and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "DEEP LEARNING AND DEVICE-ASSISTED ENTEROSCOPY: AUTOMATIC PANENDOSCOPIC DETECTION OF ULCERS AND EROSIONS"
  },
  {
    "type": "article",
    "key": "saraiva2023tu1673",
    "url": "https://www.giejournal.org/article/S0016-5107(23)02258-7/abstract",
    "doi": "https://doi.org/10.1016/j.gie.2023.04.1872",
    "publisher": "WB Saunders",
    "year": "<strong>2023</strong>",
    "pages": "S–1077",
    "number": "6",
    "volume": "164",
    "journal": "Gastroenterology",
    "author": "Saraiva, Miguel M and Pouca, Maria Vila and Ribeiro, Tiago F and Afonso, João and Cardoso, Pedro and Cardoso, Hélder and <strong>Ferreira, João</strong> and Froehner, Ilario and Macedo, Guilherme",
    "title": "Tu1673 MACHINE LEARNING AND ANORECTAL MANOMETRY: AUTOMATIC DETECTION AND DIFFERENTIATION OF ANORECTAL MOTILITY PATTERNS"
  },
  {
    "type": "article",
    "key": "ribeiro2023s61",
    "url": "https://journals.lww.com/ajg/Fulltext/2023/10001/S61_Deep_Learning_and_Endoscopic_Ultrasound_.61.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000949884.08029.58",
    "publisher": "LWW",
    "year": "2023",
    "pages": "S53–S54",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Ribeiro, Tiago and Mascarenhas, Miguel and Gonzalez, Mariano and Agudo, Belen and <strong>Ferreira, João</strong> and Afonso, João PL and Mendes, Francisco and Martins, Miguel and Cardoso, Pedro and Vilas-Boas, Filipe and others",
    "title": "S61 Deep Learning and Endoscopic Ultrasound: Automatic Characterization of Pancreatic Cystic Lesions—A Bicentric Study"
  },
  {
    "type": "article",
    "key": "mascarenhas2023s7",
    "url": "https://journals.lww.com/ajg/Fulltext/2023/10001/S7_Deep_Learning_for_Automatic_Diagnosis_and.7.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000949668.03178.12",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S7–S8",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Mascarenhas, Miguel and Gonzalez, Mariano and Ribeiro, Tiago and Agudo, Belen and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and <strong>Ferreira, João</strong> and Vilas-Boas, Filipe and Pereira, Pedro and others",
    "title": "S7 Deep Learning for Automatic Diagnosis and Morphologic Characterization of Malignant Biliary Strictures Using Digital Cholangioscopy: A Multicentric Study"
  },
  {
    "type": "article",
    "key": "afonso2023s825",
    "url": "https://journals.lww.com/ajg/fulltext/2023/10001/s825_deep_learning_and_capsule_endoscopy_.1181.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000952940.52276.55",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S611",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Afonso, João PL and Mascarenhas, Miguel and Martins, Miguel and Ribeiro, Tiago and Mendes, Francisco and Cardoso, Pedro and Andrade, Ana and <strong>Ferreira, João</strong> and Cardoso, Hélder and Macedo, Guilherme",
    "title": "S825 Deep Learning and Capsule Endoscopy: Automatic Panendoscopic Detection of Vascular Lesions"
  },
  {
    "type": "article",
    "key": "mascarenhas2023s699",
    "url": "https://journals.lww.com/ajg/fulltext/2023/10001/s699_deep_learning_and_minimally_invasive.1055.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000952436.94054.86",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S512",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Mascarenhas, Miguel and Afonso, João PL and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and Andrade, Ana and Cardoso, Hélder and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "S699 Deep Learning and Minimally Invasive Endoscopy–Panendoscopic Detection of Pleomorphic Lesions"
  },
  {
    "type": "article",
    "key": "ribeiro2023s523",
    "url": "https://journals.lww.com/ajg/fulltext/2023/10001/s523_artificial_intelligence_and_capsule.879.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000951732.24072.a3",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S380",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Ribeiro, Tiago and Mascarenhas, Miguel and Afonso, João and Cardoso, Pedro and Martins, Miguel and Mendes, Francisco and Andrade, Patrı́cia and Cardoso, Hélder and Saraiva, Miguel and <strong>Ferreira, João</strong> and others",
    "title": "S523 Artificial Intelligence and Capsule Panendoscopy: Development of a Convolutional Neural Network for the Automatic Detection of Pleomorphic Esophageal Lesions"
  },
  {
    "type": "article",
    "key": "mascarenhas2023s698",
    "url": "https://journals.lww.com/ajg/fulltext/2023/10001/s698_deep_learning_and_device_assisted.1054.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000952432.35069.be",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S511–S512",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Mascarenhas, Miguel and Afonso, João PL and Ribeiro, Tiago and Cardoso, Pedro and Mendes, Francisco and Andrade, Ana and Cardoso, Hélder and <strong>Ferreira, João</strong> and Macedo, Guilherme",
    "title": "S698 Deep Learning and Device-Assisted Enteroscopy: Multi-Device and Multi-Brand Detection of Pan-Endoscopic Pleomorphic Lesions"
  },
  {
    "type": "article",
    "key": "mascarenhas2023s173",
    "url": "https://journals.lww.com/ajg/fulltext/2023/10001/s173_deep_learning_and_high_resolution_anoscopy_.293.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000950332.28661.1f",
    "publisher": "LWW",
    "year": "<strong>2023</strong>",
    "pages": "S131",
    "number": "10S",
    "volume": "118",
    "journal": "Official journal of the American College of Gastroenterology| ACG",
    "author": "Mascarenhas, Miguel and Spindler, Lucas and Fathallah, Nadia and Ribeiro, Tiago and Afonso, João PL and Cardoso, Pedro and Mendes, Francisco and Martins, Miguel and <strong>Ferreira, João</strong> and Macedo, Guilherme and others",
    "title": "S173 Deep Learning and High-Resolution Anoscopy: Assessing the Impact of Staining and Overcoming the Impact Therapeutic Anal Manipulation in the Automated Detection and Differentiation of Anal Squamous Cell Cancer Precursors"
  },
  {
    "type": "article",
    "key": "Ribeiro2023_000333221",
    "url": "https://doi.org/10.1016/j.gie.2023.04.1252",
    "doi": "10.1016/j.gie.2023.04.1252",
    "issn": "0016-5107",
    "pages": "AB765",
    "number": "6",
    "volume": "97",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "2023",
    "journal": "Gastrointestinal Endoscopy",
    "title": "DEEP LEARNING AND CAPSULE ENDOSCOPY: PANENDOSCOPIC CLASSIFICATION OF SMALL BOWEL AND COLON PREPARATION USING A CONVOLUTIONAL NEURAL NETWORK",
    "author": "Ribeiro, Tiago and Saraiva, Miguel and Afonso, João and Cardoso, Pedro and Cardoso, Hélder and Andrade, Patrícia and <strong>Ferreira, João</strong> and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Saraiva2023_0123123",
    "url": "https://doi.org/10.1016/j.gie.2023.04.1872",
    "doi": "10.1016/j.gie.2023.04.1872",
    "issn": "0016-5107",
    "pages": "AB1240",
    "number": "6",
    "volume": "97",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "2023",
    "journal": "Gastrointestinal Endoscopy",
    "title": "DEEP LEARNING AND DEVICE-ASSISTED ENTEROSCOPY: AUTOMATIC PANENDOSCOPIC DETECTION OF ULCERS AND EROSIONS",
    "author": "Saraiva, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Pedro and Cardoso, Hélder and Andrade, Patrícia and <strong>Ferreira, João</strong> and Macedo, Guilherme"
  },
  {
    "type": "inproceedings",
    "key": "pacheco2023prediction",
    "year": "<strong>2023</strong>",
    "pages": "19",
    "booktitle": "Book of Abstracts",
    "author": "Pacheco, Luı́s and <strong>Ferreira, João </strong> and Parente, Marco",
    "title": "Prediction of surface properties from Atomic Force Microscopy nanoindentations using Neural Networks"
  },
  {
    "type": "inproceedings",
    "key": "mcarvalho_cmbbe2023",
    "year": "<strong>2023</strong>",
    "booktitle": "18th International Symposium on Computer Methods in Biomechanics and Biomedical Engineering, Paris, 3-5 May",
    "title": "Finite Element Model of the Human Breast for Large Deformation Applications",
    "author": "Mariana Carvalho and Alessandro Arduino and Marco Parente and Renato Natal and <strong>João Ferreira</strong>"
  },
  {
    "type": "article",
    "key": "Ferreira2022b",
    "note": "(<strong>FI: 9.4</strong>)",
    "url": "https://doi.org/10.1016/j.gie.2022.02.038",
    "doi": "10.1016/j.gie.2022.02.038",
    "issn": "0016-5107",
    "pages": "1284",
    "number": "6",
    "volume": "95",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2022</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "Response",
    "author": "<strong>Ferreira, João P. S.</strong> and Saraiva, Miguel Mascarenhas and Ribeiro, Tiago and Vilas Boas Silva, Filipe and Pereira, Pedro and Jorge, Renato N. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Mascarenhas12061445",
    "note": "(<strong>FI: 3.992</strong>)",
    "url": "https://www.mdpi.com/2075-4418/12/6/1445",
    "doi": "10.3390/diagnostics12061445",
    "abstract": "Background: Colon capsule endoscopy (CCE) is an alternative for patients unwilling or with contraindications for conventional colonoscopy. Colorectal cancer screening may benefit greatly from widespread acceptance of a non-invasive tool such as CCE. However, reviewing CCE exams is a time-consuming process, with risk of overlooking important lesions. We aimed to develop an artificial intelligence (AI) algorithm using a convolutional neural network (CNN) architecture for automatic detection of colonic protruding lesions in CCE images. An anonymized database of CCE images collected from a total of 124 patients was used. This database included images of patients with colonic protruding lesions or patients with normal colonic mucosa or with other pathologic findings. A total of 5715 images were extracted for CNN development. Two image datasets were created and used for training and validation of the CNN. The AUROC for detection of protruding lesions was 0.99. The sensitivity, specificity, PPV and NPV were 90.0%, 99.1%, 98.6% and 93.2%, respectively. The overall accuracy of the network was 95.3%. The developed deep learning algorithm accurately detected protruding lesions in CCE images. The introduction of AI technology to CCE may increase its diagnostic accuracy and acceptance for screening of colorectal neoplasia.",
    "issn": "2075-4418",
    "pubmedid": "35741255",
    "article-number": "1445",
    "number": "6",
    "year": "<strong>2022</strong>",
    "volume": "12",
    "journal": "Diagnostics",
    "title": "Performance of a Deep Learning System for Automatic Diagnosis of Protruding Lesions in Colon Capsule Endoscopy",
    "author": "Mascarenhas, Miguel and Afonso, João and Ribeiro, Tiago and Cardoso, Hélder and Andrade, Patrícia and <strong>Ferreira, João P. S.</strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "mm_manometry_2022",
    "note": "(<strong>FI: 4.396</strong>)",
    "url": "https://journals.lww.com/ctg/Fulltext/9900/ARTIFICIAL_INTELLIGENCE_AND_ANORECTAL_MANOMETRY_.119.aspx",
    "issn": "2155-384X",
    "abstract": "BACKGROUND: Anorectal manometry (ARM) is the gold standard for the evaluation of anorectal functional disorders, prevalent in the population. Nevertheless, the accessibility to this exam is limited, and the complexity of data analysis and report is a significant drawback. This pilot study aimed to develop and validate an artificial intelligence (AI) model to automatically differentiate motility patterns of fecal incontinence (FI) from obstructed defecation (OD) using ARM data. METHODS: We developed and tested multiple machine learning algorithms for the automatic interpretation of ARM data. Four models were tested: k-nearest neighbors (KNN), support vector machines (SVM), random forests (RF) and gradient boosting (xGB). These models were trained using a stratified 5-fold strategy. Their performance was assessed after fine-tuning of each model's hyperparameters, using 90% of data for training and 10% of data for testing. RESULTS: A total of 827 ARM exams were used in this study. After fine-tuning, the xGB model presented an overall accuracy (84.6% \\textpm 2.9%), similar to that of RF (82.7% \\textpm 4.8%) and SVM (81.0% \\textpm 8.0%), and higher that of KNN (74.4% \\textpm 3.8%). The xGB models showed the highest discriminating performance between OD and FI, with an area under the curve of 0.939. CONCLUSION: The tested machine learning algorithms, particularly the xGB model, accurately differentiated between FI and OD manometric patterns. Subsequent development of these tools may optimize the access to ARM studies, which may have a significant impact on the management of patients with anorectal functional diseases. © 2022 The Author(s). Published by Wolters Kluwer Health, Inc. on behalf of The American College of Gastroenterology",
    "year": "<strong>2022</strong>",
    "journal": "Clinical and Translational Gastroenterology",
    "title": "Artificial intelligence and anorectal manometry: automatic detection and differentiation of anorectal motility patterns - a proof of concept study",
    "author": "Saraiva, Miguel Mascarenhas and Pouca, Maria Vila and Ribeiro, Tiago and Afonso, João and Cardoso, Hélder and Sousa, Pedro and <strong>Ferreira, João</strong> and Macedo, Guilherme and Junior, Ilario Froehner"
  },
  {
    "type": "article",
    "key": "pcardoso22a",
    "note": "(<strong>FI: 4.488</strong>)",
    "doi": "10.14309/ctg.0000000000000514",
    "url": "https://journals.lww.com/ctg/Fulltext/2022/08000/Artificial_Intelligence_and_Device_Assisted.2.aspx",
    "issn": "2155-384X",
    "abstract": "INTRODUCTION: Device-assisted enteroscopy (DAE) plays a major role in the investigation and endoscopic treatment of small bowel diseases. Recently, the implementation of artificial intelligence (AI) algorithms to gastroenterology has been the focus of great interest. Our aim was to develop an AI model for the automatic detection of protruding lesions in DAE images. METHODS: A deep learning algorithm based on a convolutional neural network was designed. Each frame was evaluated for the presence of enteric protruding lesions. The area under the curve, sensitivity, specificity, and positive and negative predictive values were used to assess the performance of the convolutional neural network. RESULTS: A total of 7,925 images from 72 patients were included. Our model had a sensitivity and specificity of 97.0% and 97.4%, respectively. The area under the curve was 1.00. DISCUSSION: Our model was able to efficiently detect enteric protruding lesions. The development of AI tools may enhance the diagnostic capacity of deep enteroscopy techniques.",
    "number": "8",
    "volume": "13",
    "year": "<strong>2022</strong>",
    "journal": "Clinical and Translational Gastroenterology",
    "title": "Artificial Intelligence and Device-Assisted Enteroscopy: Automatic Detection of Enteric Protruding Lesions Using a Convolutional Neural Network",
    "author": "Cardoso, Pedro and Saraiva, Miguel Mascarenhas and Afonso, João and Ribeiro, Tiago and Andrade, Patrícia and <strong>Ferreira, João</strong> and Cardoso, Hélder and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Saraiva2022aaaa12",
    "note": "(<strong>FI: 3.699</strong>)",
    "url": "https://doi.org/10.1007/s10151-022-02684-z",
    "doi": "10.1007/s10151-022-02684-z",
    "issn": "1128-045X",
    "abstract": "High-resolution anoscopy (HRA) is the gold standard for detecting anal squamous cell cancer (ASCC) precursors. Although it is superior to other diagnostic methods, particularly cytology, the visual identification of areas suspected of having high-grade squamous intraepithelial lesions remains difficult. Convolutional neural networks (CNNs) have shown great potential for assessing endoscopic images. The aim of the present study was to develop a CNN-based system for automatic detection and differentiation of HSIL versus LSIL in HRA images.",
    "pages": "893-900",
    "number": "11",
    "volume": "26",
    "day": "01",
    "month": "Nov",
    "year": "<strong>2022</strong>",
    "journal": "Techniques in Coloproctology",
    "title": "Artificial intelligence and high-resolution anoscopy: automatic identification of anal squamous cell carcinoma precursors using a convolutional neural network",
    "author": "Saraiva, M. M. and Spindler, L. and Fathallah, N. and Beaussier, H. and Mamma, C. and Quesnée, M. and Ribeiro, T. and Afonso, J. and Carvalho, M. and Moura, R. and Andrade, P. and Cardoso, H. and Adam, J. and <strong>Ferreira, J.</strong> and Macedo, G. and de Parades, V."
  },
  {
    "type": "article",
    "key": "vilasboas2022",
    "note": "(<strong>FI: 3.992</strong>)",
    "doi": "10.3390/diagnostics12092041",
    "url": "https://www.mdpi.com/2075-4418/12/9/2041",
    "pages": "2041",
    "number": "9",
    "year": "<strong>2022</strong>",
    "volume": "12",
    "journal": "Diagnostics",
    "title": "Deep Learning for Automatic Differentiation of Mucinous versus Non-Mucinous Pancreatic Cystic Lesions: A Pilot Study",
    "author": "Vilas-Boas, Filipe and Ribeiro, Tiago and Afonso, Joao and Cardoso, Helder and Lopes, Susana and Moutinho-Ribeiro, Pedro and <strong>Ferreira, João</strong> and Mascarenhas-Saraiva, Miguel and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Afonsoqqq2022",
    "note": "(<strong>FI: 2.602</strong>)",
    "url": "https://doi.org/10.1007/s11517-021-02486-9",
    "doi": "10.1007/s11517-021-02486-9",
    "issn": "1741-0444",
    "abstract": "Capsule endoscopy (CE) is an important tool in the management of patients with known or suspected inflammatory bowel disease. Ulcers and erosions of the enteric mucosa are prevalent findings in these patients. They frequently occur together, and their identification in CE is crucial for an accurate evaluation of disease severity. Nevertheless, reviewing CE images is a time-consuming task, and the risk of overlooking lesions is significant.",
    "pages": "719-725",
    "number": "3",
    "volume": "60",
    "day": "01",
    "month": "Mar",
    "year": "<strong>2022</strong>",
    "journal": "Medical & Biological Engineering & Computing",
    "title": "Automated detection of ulcers and erosions in capsule endoscopy images using a convolutional neural network",
    "author": "Afonso, João and Saraiva, Miguel Mascarenhas and <strong>Ferreira</strong>, <strong>J. P. S.</strong> and Cardoso, Hélder and Ribeiro, Tiago and Andrade, Patrícia and Parente, Marco and Jorge, Renato N. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "mvp2022ajog",
    "note": "(<strong>FI: 8.661</strong>)",
    "url": "https://doi.org/10.1016/j.ajog.2022.01.023",
    "doi": "10.1016/j.ajog.2022.01.023",
    "issn": "0002-9378",
    "publisher": "Elsevier",
    "month": "2022/06/25",
    "year": "<strong>2022</strong>",
    "journal": "American Journal of Obstetrics & Gynecology",
    "title": "On the management of maternal pushing during the second stage of labor: a biomechanical study considering passive tissue fatigue damage accumulation",
    "author": "Vila Pouca, Maria C.P. and <strong>Ferreira</strong>, <strong>J. P. S.</strong> and Parente, Marco P.L. and Natal Jorge, Renato M. and Ashton-Miller, James A."
  },
  {
    "type": "article",
    "key": "Mascarenhas16022022",
    "url": "https://doi.org/10.1055/a-1683-0942",
    "doi": "10.1055/a-1683-0942",
    "language": "EN",
    "note": "E171",
    "pages": "E171-E177",
    "number": "02",
    "volume": "10",
    "year": "16.02.2022",
    "journal": "Endosc Int Open",
    "title": "Deep learning and colon capsule endoscopy: automatic detection of blood and colonic mucosal lesions using a convolutional neural network",
    "author": "Mascarenhas, Miguel and Ribeiro, Tiago and Afonso, João and <strong>Ferreira</strong>, <strong>J P S </strong> and Cardoso, Hélder and Andrade, Patrícia and Parente, Marco P.L. and Jorge, Renato N. and Mascarenhas Saraiva, Miguel and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "carvalho22",
    "note": "(<strong>FI: 2.648</strong>)",
    "year": "<strong>2022</strong>",
    "abstract": "Abstract Regular intestinal motility is essential to guarantee complete digestive function. The coordinative action and integrity of the smooth muscle layers in the small intestine's wall are critical for mixing and propelling the luminal content. However, some patients present gastrointestinal limitations which may negatively impact the normal motility of the intestine. These patients have altered mechanical and muscle properties that likely impact chyme propulsion and may pose a daily scenario for long-term complications. To better understand how mechanics affect chyme propulsion, the propulsive capability of the small intestine was examined during a peristaltic wave along the distal direction of the tract. It was assumed that such a wave works as an activation signal, inducing peristaltic contractions in a transversely isotropic hyperelastic model. In this work, the effect on the propulsion mechanics, from an impairment on the muscle contractile ability, typical from patients with systemic sclerosis, and the presence of sores resultant from ulcers was evaluated. The passive properties of the constitutive model were obtained from uniaxial tensile tests from a porcine small intestine, along with both longitudinal and circumferential directions. Our experiments show decreased stiffness in the circumferential direction. Our simulations show decreased propulsion forces in patients in systemic sclerosis and ulcer patients. As these patients may likely need medical intervention, establishing action concerning the impaired propulsion can help to ease the evaluation and treatment of future complications.",
    "eprint": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/cnm.3588",
    "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cnm.3588",
    "doi": "https://doi.org/10.1002/cnm.3588",
    "keywords": "fiber-reinforcement, finite element method, hyperelasticity, peristalsis, small intestine, uniaxial tensile test",
    "pages": "e3588",
    "number": "5",
    "volume": "38",
    "journal": "International Journal for Numerical Methods in Biomedical Engineering",
    "title": "Biomechanical characterization of the small intestine to simulate gastrointestinal tract chyme propulsion",
    "author": "Carvalho, Mariana R. and <strong>Ferreira</strong>, <strong>J P S </strong> and Oliveira, Dulce A. and Parente, Marco P. L. and Natal Jorge, Renato M."
  },
  {
    "type": "article",
    "key": "Pereira14032022",
    "doi": "10.1055/a-1725-3812",
    "language": "EN",
    "note": "E262",
    "pages": "E262-E268",
    "number": "03",
    "volume": "10",
    "year": "14.03.2022",
    "journal": "Endosc Int Open",
    "title": "Automatic detection of tumor vessels in indeterminate biliary strictures in digital single-operator cholangioscopy",
    "author": "Pereira, Pedro and Mascarenhas, Miguel and Ribeiro, Tiago and Afonso, João and <strong>Ferreira</strong>, <strong>J P S </strong> and Vilas-Boas, Filipe and Parente, Marco P.L. and Jorge, Renato N. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "app12073381",
    "note": "(<strong>FI: 2.838</strong>)",
    "doi": "10.3390/app12073381",
    "abstract": "Bone is an outstanding, well-designed composite. It is constituted by a multi-level structure wherein its properties and behavior are dependent on its composition and structural organization at different length scales. The combination of unique mechanical properties with adaptive and self-healing abilities makes bone an innovative model for the future design of synthetic biomimetic composites with improved performance in bone repair and regeneration. However, the relation between structure and properties in bone is very complex. In this review article, we intend to describe the hierarchical organization of bone on progressively greater scales and present the basic concepts that are fundamental to understanding the arrangement-based mechanical properties at each length scale and their influence on bone&rsquo;s overall structural behavior. The need for a better understanding of bone&rsquo;s intricate composite structure is also highlighted.",
    "issn": "2076-3417",
    "url": "https://www.mdpi.com/2076-3417/12/7/3381",
    "article-number": "3381",
    "number": "7",
    "year": "<strong>2022</strong>",
    "volume": "12",
    "journal": "Applied Sciences",
    "title": "Bone: An Outstanding Composite Material",
    "author": "Rosa, Natacha and Moura, Marcelo F. S. F. and Olhero, Susana and Simoes, Ricardo and Magalhães, Fernão D. and Marques, António Torres and <strong>Ferreira</strong>, <strong>J P S </strong> and Reis, Ana Rita and Carvalho, Mariana and Parente, Marco"
  },
  {
    "type": "article",
    "key": "app12052623",
    "note": "(<strong>FI: 2.838</strong>)",
    "doi": "10.3390/app12052623",
    "abstract": "The epiretinal membrane is a thin sheet of fibrous tissue that can form over the macular area of the retina, and may result in the loss of visual acuity or metamorphopsia, due to superficial retinal folds. A vitrectomy surgery, the current treatment procedure for this pathology, is only performed after symptoms are present. However, sometimes the patients do not present any vision improvements after the surgery. The use of computational methods for a patient-specific biomechanical analysis can contribute to better understanding the mechanisms behind the success or failure of a vitrectomy. Using medical data from two patients who underwent a vitrectomy, one with substantial improvements and another with no improvements, an analysis of the retinal displacement due to the contraction of the epiretinal membrane was performed. Our results suggest a causal effect between the magnitude of the retinal displacements caused by the epiretinal membrane contraction and the outcome of the vitrectomy procedure.",
    "issn": "2076-3417",
    "url": "https://www.mdpi.com/2076-3417/12/5/2623",
    "article-number": "2623",
    "number": "5",
    "year": "<strong>2022</strong>",
    "volume": "12",
    "journal": "Applied Sciences",
    "title": "Finite Element Analysis of the Epiretinal Membrane Contraction",
    "author": "Reis, Ana Rita and <strong>Ferreira</strong>, <strong>J P S </strong> and Guerra, Ana and Fernandes, António and Torres-Costa, Sónia and Falcão, Manuel and Parente, Marco P. L."
  },
  {
    "type": "article",
    "key": "joao_protruding2022",
    "note": "(<strong>FI: 2.700</strong>)",
    "doi": "10.1016/j.gastha.2022.04.008",
    "url": "https://doi.org/10.1016/j.gastha.2022.04.008",
    "year": "<strong>2022</strong>",
    "journal": "Gastro Hep Advances",
    "title": "Deep Learning for Automatic Identification and Characterization of the Bleeding Potential of Enteric Protruding Lesions in Capsule Endoscopy",
    "author": "Afonso, Joao and Mascarenhas, Miguel and Ribeiro, Tiago and Cardoso, Helder and Andrade, Patricia and <strong>Ferreira</strong>, <strong>J P S </strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Afonso2022asdffg",
    "note": "(<strong>FI: 2.602</strong>)",
    "url": "https://doi.org/10.1007/s11517-021-02486-9",
    "doi": "10.1007/s11517-021-02486-9",
    "issn": "1741-0444",
    "abstract": "Capsule endoscopy (CE) is an important tool in the management of patients with known or suspected inflammatory bowel disease. Ulcers and erosions of the enteric mucosa are prevalent findings in these patients. They frequently occur together, and their identification in CE is crucial for an accurate evaluation of disease severity. Nevertheless, reviewing CE images is a time-consuming task, and the risk of overlooking lesions is significant.",
    "pages": "719-725",
    "number": "3",
    "volume": "60",
    "day": "01",
    "month": "Mar",
    "year": "<strong>2022</strong>",
    "journal": "Medical & Biological Engineering & Computing",
    "title": "Automated detection of ulcers and erosions in capsule endoscopy images using a convolutional neural network",
    "author": "Afonso, João and Saraiva, Miguel Mascarenhas and <strong>Ferreira</strong>, <strong>J P S </strong> and Cardoso, Hélder and Ribeiro, Tiago and Andrade, Patrícia and Parente, Marco and Jorge, Renato N. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "diagnostics12061445",
    "note": "(<strong>FI: 3.992</strong>)",
    "doi": "10.3390/diagnostics12061445",
    "abstract": "Background: Colon capsule endoscopy (CCE) is an alternative for patients unwilling or with contraindications for conventional colonoscopy. Colorectal cancer screening may benefit greatly from widespread acceptance of a non-invasive tool such as CCE. However, reviewing CCE exams is a time-consuming process, with risk of overlooking important lesions. We aimed to develop an artificial intelligence (AI) algorithm using a convolutional neural network (CNN) architecture for automatic detection of colonic protruding lesions in CCE images. An anonymized database of CCE images collected from a total of 124 patients was used. This database included images of patients with colonic protruding lesions or patients with normal colonic mucosa or with other pathologic findings. A total of 5715 images were extracted for CNN development. Two image datasets were created and used for training and validation of the CNN. The AUROC for detection of protruding lesions was 0.99. The sensitivity, specificity, PPV and NPV were 90.0%, 99.1%, 98.6% and 93.2%, respectively. The overall accuracy of the network was 95.3%. The developed deep learning algorithm accurately detected protruding lesions in CCE images. The introduction of AI technology to CCE may increase its diagnostic accuracy and acceptance for screening of colorectal neoplasia.",
    "issn": "2075-4418",
    "url": "https://www.mdpi.com/2075-4418/12/6/1445",
    "article-number": "1445",
    "number": "6",
    "year": "<strong>2022</strong>",
    "volume": "12",
    "journal": "Diagnostics",
    "title": "Performance of a Deep Learning System for Automatic Diagnosis of Protruding Lesions in Colon Capsule Endoscopy",
    "author": "Mascarenhas, Miguel and Afonso, Joao and Ribeiro, Tiago and Cardoso, Helder and Andrade, Patricia and <strong>Ferreira</strong>, <strong>J P S </strong> and Saraiva, Miguel Mascarenhas and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "tr20221000200025_acg2022",
    "url": "https://journals.lww.com/ajg/Fulltext/2022/10002/S25_Deep_Learning_for_the_Automatic_Identification.25.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000856740.48694.91",
    "issn": "0002-9270",
    "number": "10S",
    "volume": "117",
    "year": "<strong>2022</strong>",
    "journal": "Official journal of the American College of Gastroenterology | ACG",
    "title": "S25 - Deep Learning for the Automatic Identification of Neoplastic Biliary Nodules in Patients With Indeterminate Biliary Stenosis During Digital Cholangioscopy",
    "author": "Ribeiro, Tiago and Mascarenhas, Miguel and Afonso, Joao and Vilas-Boas, Filipe and <strong>Ferreira, João</strong> and Pereira, Pedro and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "mm00000434_acg2022",
    "url": "https://journals.lww.com/ajg/Fulltext/2022/10002/S134_Artificial_Intelligence_and_High_Resolution.134.aspx",
    "doi": "https://doi.org/10.14309/01.ajg.0000857176.10120.1e",
    "issn": "0002-9270",
    "number": "10S",
    "volume": "117",
    "year": "<strong>2022</strong>",
    "journal": "Official journal of the American College of Gastroenterology | ACG",
    "title": "S134 - Artificial Intelligence and High-Resolution Anoscopy: Automatic Identification of Anal Squamous Cell Carcinoma Precursors Using a Convolutional Neural Network",
    "author": "Mascarenhas, Miguel and Spindler, Lucas and Fathallah, Nadia and Ribeiro, Tiago and Afonso, Joao and <strong>Ferreira, João</strong> and Macedo, Guilherme and De Parades, Vincent"
  },
  {
    "type": "article",
    "key": "Afonso122_colo_2022",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1764617",
    "doi": "10.1055/s-0043-1764617",
    "issn": "2237-9363",
    "pages": "A117",
    "number": "S 01",
    "volume": "42",
    "publisher": "Thieme Revinter Publicações Ltda.",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Coloproctology",
    "title": "AUTOMATIC DETECTION OF MULTIPLE LESIONS IN DEVICE-ASSISTED ENTEROSCOPY USING A CONVOLUTIONAL NEURAL NETWORK – A PILOT STUDY",
    "author": "Afonso, João Pedro Lima; Saraiva, Miguel Mascarenhas; Ribeiro, Tiago; Cardoso, Pedro; <strong>Ferreira, João</strong>; Andrade, Ana Patrícia; Cardoso, Hélder; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Ribeiro12111_colo2022",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1764621",
    "doi": "10.1055/s-0043-1764621",
    "issn": "2237-9363",
    "pages": "A121",
    "number": "S 01",
    "volume": "42",
    "publisher": "Thieme Revinter Publicações Ltda.",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Coloproctology",
    "title": "ESTUDO PILOTO EM INTELIGÊNCIA ARTIFICIAL PARA A DETEÇÃO AUTOMÁTICA DE LESÕES PROTUBERANTES DO INTESTINO DELGADO EM ENTEROSCOPIA PROFUNDA",
    "author": "Ribeiro, Tiago; Mascarenhas, Miguel; Afonso, João; Cardoso, Pedro; Cardoso, Hélder; <strong>Ferreira, João</strong>; Andrade, Patrícia; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Mascarenhas12123_colo2022",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1764634",
    "doi": "10.1055/s-0043-1764634",
    "issn": "2237-9363",
    "pages": "A134",
    "number": "S 01",
    "volume": "42",
    "publisher": "Thieme Revinter Publicações Ltda.",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Coloproctology",
    "title": "ESTUDO PILOTO PARA A APLICAÇÃO DE INTELIGÊNCIA ARTIFICIAL E MANOMETRIA ANORRETAL: DETEÇÃO E DIFERENCIAÇÃO AUTOMÁTICA DE PADRÕES DE MOTILIDADE ANORRETAL",
    "author": "Mascarenhas, Miguel; Froehner, Ilário; Ribeiro, Tiago; Afonso, João; Sousa, Pedro; Pouca, Maria Vila; <strong>Ferreira, João</strong>; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Mascarenhas12_colo2022",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1764533",
    "doi": "10.1055/s-0043-1764533",
    "issn": "2237-9363",
    "pages": "A033",
    "number": "S 01",
    "volume": "42",
    "publisher": "Thieme Revinter Publicações Ltda.",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Coloproctology",
    "title": "INTELIGÊNCIA ARTIFICIAL E ANUSCOPIA DE ALTA RESOLUÇÃO: IDENTIFICAÇÃO DE PRECURSORES DE CARCINOMA DO CANAL ANAL USANDO UMA REDE NEURAL CONVOLUCIONAL",
    "author": "Mascarenhas, Miguel; Spindler, Lucas; Fathallah, Nadia; Ribeiro, Tiago; Afonso, João; Cardoso, Pedro; <strong>Ferreira, João</strong>; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Afonso12_colo2022",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1764615",
    "doi": "10.1055/s-0043-1764615",
    "issn": "2237-9363",
    "pages": "A115",
    "number": "S 01",
    "volume": "42",
    "publisher": "Thieme Revinter Publicações Ltda.",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Coloproctology",
    "title": "ARTIFICIAL INTELLIGENCE AND PILLCAM CROHN'S CAPSULE: AUTOMATIC CLASSIFICATION OF COLON PREPARATION USING A CONVOLUTIONAL NEURAL NETWORK – A MULTICENTRIC PILOT STUDY",
    "author": "Afonso, João Pedro Lima; Saraiva, Miguel Mascarenhas; Ribeiro, Tiago; Cardoso, Pedro; Andrade, Ana Patrícia; <strong>Ferreira, João</strong>; Cardoso, Hélder; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "mascaranhas2022c",
    "url": "https://www.journal-of-hepatology.eu/issue/S0168-8278(22)X0007-X",
    "doi": "10.1016/S0168-8278(22)00470-6",
    "issn": "0016-5107",
    "number": "77",
    "volume": "S28-S29",
    "publisher": "Elsevier",
    "year": "<strong>2022</strong>",
    "journal": "Journal of Hepatology",
    "title": "OS024 - Development of a convolutional neural network for automatic detection and phenotypic differentiation of pancreatic cystic lesions",
    "author": "Mascarenhas, M. and Afonso, João and Santos, Ana and Cardoso, Helder and <strong>Ferreira, João</strong> and Vilas-Boas, Filipe and Pereira, Pedro and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Ribeiro2022c",
    "url": "https://doi.org/10.1016/j.gie.2022.04.1256",
    "doi": "10.1016/j.gie.2022.04.1256",
    "issn": "0016-5107",
    "pages": "AB497-AB498",
    "number": "6",
    "volume": "95",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2022</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "Development of a convolutional neural network for automatic detection and phenotypic differentiation of pancreatic cystic lesions",
    "author": "Ribeiro, Tiago F. and Vilas-Boas, Filipe and Afonso, João and <strong>Ferreira, João</strong> and Lopes, Susana and Moutinho, Pedro and Saraiva, Miguel M. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Ribeiro2022ak2",
    "url": "https://doi.org/10.1016/j.gie.2022.04.1156",
    "doi": "10.1016/j.gie.2022.04.1156",
    "issn": "0016-5107",
    "pages": "AB459",
    "number": "6",
    "volume": "95",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2022</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "Development of a combined deep learning model for automatic detection of multiple gastrointestinal lesions in device-assisted enteroscopy using convolutional neural networks",
    "author": "Ribeiro, Tiago F. and Saraiva, Miguel M. and Afonso, João and <strong>Ferreira, João</strong> and Andrade, Patricia and Cardoso, Helder and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Saraiva2022aaannn",
    "url": "https://doi.org/10.1016/j.gie.2022.04.818",
    "doi": "10.1016/j.gie.2022.04.818",
    "issn": "0016-5107",
    "pages": "AB313-AB314",
    "number": "6",
    "volume": "95",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2022</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "Deep learning and digital single-operator cholangioscopy (dsoc): automatic diagnosis of malignancy status and morphological characterization of biliary strictures",
    "author": "Saraiva, Miguel M. and Ribeiro, Tiago F. and Afonso, João and Santos, Ana L. and <strong>Ferreira, João</strong> and Vilas-Boas, Filipe and Pereira, Pedro and Macedo, Guilherme"
  },
  {
    "type": "inproceedings",
    "key": "monteiro_reis_aspic2022",
    "year": "<strong>2022</strong>",
    "booktitle": "5th ASPIC International congress, Porto, 30th June-01st July",
    "title": "Bladder stiffness after cystectomy in bladder cancer patients: a pilot study.",
    "author": "Monteiro-Reis, S and <strong>Ferreira, J P S</strong> and Pires, R. and Lobo, J. and Natal and R., Jeronimo, C."
  },
  {
    "type": "inproceedings",
    "key": "mcarvalho_5ejil_2022",
    "year": "<strong>2022</strong>",
    "booktitle": "5th Meeting of the Young Researchers of LAETA Lisboa, Portugal",
    "title": "Gastrointestinal tract chyme propulsion in patients with gastrointestinal limitations",
    "author": "Mariana R. Carvalho; <strong>Ferreira, J P S</strong>; Marco P. L. Parente; Renato M. Natal"
  },
  {
    "type": "article",
    "key": "mm2022",
    "note": "(<strong>FI: 4.488</strong>)",
    "url": "https://journals.lww.com/ctg/Fulltext/2021/11000/Automatic_Identification_of_Papillary_Projections.1.aspx",
    "issn": "2155-384X",
    "abstract": "INTRODUCTION: Characterization of biliary strictures is challenging. Papillary projections (PP) are often reported in biliary strictures with high malignancy potential during digital single-operator cholangioscopy. In recent years, the development of artificial intelligence (AI) algorithms for application to endoscopic practice has been intensely studied. We aimed to develop an AI algorithm for automatic detection of PP in digital single-operator cholangioscopy images. METHODS: A convolutional neural network (CNN) was developed. Each frame was evaluated for the presence of PP. The CNN's performance was measured by the area under the curve, sensitivity, specificity, and positive and negative predictive values. RESULTS: A total of 3,920 images from 85 patients were included. Our model had a sensitivity and specificity 99.7% and 97.1%, respectively. The area under the curve was 1.00. DISCUSSION: Our CNN was able to detect PP with high accuracy. Future development of AI tools may optimize the macroscopic characterization of biliary strictures.",
    "number": "11",
    "volume": "12",
    "year": "<strong>2021</strong>",
    "journal": "Clinical and Translational Gastroenterology",
    "title": "Automatic Identification of Papillary Projections in Indeterminate Biliary Strictures Using Digital Single-Operator Cholangioscopy",
    "author": "Ribeiro, Tiago and Saraiva, Miguel Mascarenhas and Afonso, João and <strong>Ferreira</strong>, <strong>J. P. S.</strong> and Boas, Filipe Vilas and Parente, Marco P. L. and Jorge, Renato N. and Pereira, Pedro and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "mascarenhas2021ge_portuguese",
    "eprint": "https://karger.com/pjg/article-pdf/29/5/331/3701229/000518901.pdf",
    "url": "https://doi.org/10.1159/000518901",
    "doi": "10.1159/000518901",
    "issn": "2341-4545",
    "abstract": "Introduction: Capsule endoscopy has revolutionized the management of patients with obscure gastrointestinal bleeding. Nevertheless, reading capsule endoscopy images is time-consuming and prone to overlooking significant lesions, thus limiting its diagnostic yield. We aimed to create a deep learning algorithm for automatic detection of blood and hematic residues in the enteric lumen in capsule endoscopy exams. Methods: A convolutional neural network was developed based on a total pool of 22,095 capsule endoscopy images (13,510 images containing luminal blood and 8,585 of normal mucosa or other findings). A training dataset comprising 80\\% of the total pool of images was defined. The performance of the network was compared to a consensus classification provided by 2 specialists in capsule endoscopy. Subsequently, we evaluated the performance of the network using an independent validation dataset (20\\% of total image pool), calculating its sensitivity, specificity, accuracy, and precision. Results: Our convolutional neural network detected blood and hematic residues in the small bowel lumen with an accuracy and precision of 98.5 and 98.7\\%, respectively. The sensitivity and specificity were 98.6 and 98.9\\%, respectively. The analysis of the testing dataset was completed in 24 s (approximately 184 frames/s). Discussion/Conclusion: We have developed an artificial intelligence tool capable of effectively detecting luminal blood. The development of these tools may enhance the diagnostic accuracy of capsule endoscopy when evaluating patients presenting with obscure small bowel bleeding.",
    "month": "09",
    "year": "<strong>2021</strong>",
    "pages": "331-338",
    "number": "5",
    "volume": "29",
    "journal": "GE - Portuguese Journal of Gastroenterology",
    "title": "Artificial Intelligence and Capsule Endoscopy: Automatic Detection of Small Bowel Blood Content Using a Convolutional Neural Network",
    "author": "Mascarenhas Saraiva, Miguel and Ribeiro, Tiago and Afonso, João and <strong>Ferreira, João P. S.</strong> and Cardoso, Hélder and Andrade, Patrícia and Parente, Marco P.L. and Jorge, Renato N. and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "medicina57121378",
    "note": "(<strong>FI: 2.948</strong>)",
    "doi": "10.3390/medicina57121378",
    "abstract": "Background and Objectives: Device-assisted enteroscopy (DAE) allows deep exploration of the small bowel and combines diagnostic and therapeutic capacities. Suspected mid-gastrointestinal bleeding is the most frequent indication for DAE, and vascular lesions, particularly angioectasia, are the most common etiology. Nevertheless, the diagnostic yield of DAE for the detection of these lesions is suboptimal. Deep learning algorithms have shown great potential for automatic detection of lesions in endoscopy. We aimed to develop an artificial intelligence (AI) model for the automatic detection of angioectasia DAE images. Materials and Methods: A convolutional neural network (CNN) was developed using DAE images. Each frame was labeled as normal/mucosa or angioectasia. The image dataset was split for the constitution of training and validation datasets. The latter was used for assessing the performance of the CNN. Results: A total of 72 DAE exams were included, and 6740 images were extracted (5345 of normal mucosa and 1395 of angioectasia). The model had a sensitivity of 88.5%, a specificity of 97.1% and an AUC of 0.988. The image processing speed was 6.4 ms/frame. Conclusions: The application of AI to DAE may have a significant impact on the management of patients with suspected mid-gastrointestinal bleeding.",
    "issn": "1648-9144",
    "pubmedid": "34946323",
    "url": "https://www.mdpi.com/1648-9144/57/12/1378",
    "article-number": "1378",
    "number": "12",
    "year": "<strong>2021</strong>",
    "volume": "57",
    "journal": "Medicina",
    "title": "Deep Learning and Device-Assisted Enteroscopy: Automatic Detection of Gastrointestinal Angioectasia",
    "author": "Mascarenhas Saraiva, Miguel and Ribeiro, Tiago and Afonso, Joao and Andrade, Patricia and Cardoso, Pedro and <strong>Ferreira</strong>, <strong>J. P. S.</strong> and Cardoso, Hélder and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Mascarenhas_Saraivae000753_2021",
    "note": "(<strong>FI: 3.050</strong>)",
    "journal": "BMJ Open Gastroenterology",
    "eprint": "https://bmjopengastro.bmj.com/content/8/1/e000753.full.pdf",
    "url": "https://bmjopengastro.bmj.com/content/8/1/e000753",
    "abstract": "Objective Capsule endoscopy (CE) is pivotal for evaluation of small bowel disease. Obscure gastrointestinal bleeding most often originates from the small bowel. CE frequently identifies a wide range of lesions with different bleeding potentials in these patients. However, reading CE examinations is a time-consuming task. Convolutional neural networks (CNNs) are highly efficient artificial intelligence tools for image analysis. This study aims to develop a CNN-based model for identification and differentiation of multiple small bowel lesions with distinct haemorrhagic potential using CE images.Design We developed, trained, and validated a denary CNN based on CE images. Each frame was labelled according to the type of lesion (lymphangiectasia, xanthomas, ulcers, erosions, vascular lesions, protruding lesions, and blood). The haemorrhagic potential was assessed by Saurin\\textquoterights classification. The entire dataset was divided into training and validation sets. The performance of the CNN was measured by the area under the receiving operating characteristic curve, sensitivity, specificity, positive predictive value (PPV), and negative predictive value (NPV).Results A total of 53 555 CE images were included. The model had an overall accuracy of 99%, a sensitivity of 88%, a specificity of 99%, a PPV of 87%, and an NPV of 99% for detection of multiple small bowel abnormalities and respective classification of bleeding potential.Conclusion We developed and tested a CNN-based model for automatic detection of multiple types of small bowel lesions and classification of the respective bleeding potential. This system may improve the diagnostic yield of CE for these lesions and overall CE efficiency.All data relevant to the study are included in the article or uploaded as supplementary information.",
    "publisher": "BMJ Specialist Journals",
    "doi": "10.1136/bmjgast-2021-000753",
    "year": "<strong>2021</strong>",
    "elocation-id": "e000753",
    "number": "1",
    "volume": "8",
    "title": "Deep learning and capsule endoscopy: automatic identification and differentiation of small bowel lesions with distinct haemorrhagic potential using a convolutional neural network",
    "author": "Miguel José Mascarenhas Saraiva and João Afonso and Tiago Ribeiro and <strong>João Ferreira</strong> and Helder Cardoso and Ana Patricia Andrade and Marco Parente and Renato Natal and Miguel Mascarenhas Saraiva and Guilherme Macedo"
  },
  {
    "type": "article",
    "key": "MS_colon_2021",
    "note": "(<strong>FI: 3.3</strong>)",
    "language": "EN",
    "url": "http://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1490-8960",
    "doi": "10.1055/a-1490-8960",
    "issn": "2364-3722",
    "abstract": "Colon capsule endoscopy (CCE) is a minimally invasive alternative to conventional colonoscopy. Most studies on CCE focus on colorectal neoplasia detection. The development of automated tools may address some of the limitations of this diagnostic tool and widen its indications for different clinical settings. We developed an artificial intelligence model based on a convolutional neural network (CNN) for the automatic detection of blood content in CCE images. Training and validation datasets were constructed for the development and testing of the CNN. The CNN detected blood with a sensitivity, specificity, and positive and negative predictive values of 99.8 %, 93.2 %, 93.8 %, and 99.8 %, respectively. The area under the receiver operating characteristic curve for blood detection was 1.00. We developed a deep learning algorithm capable of accurately detecting blood or hematic residues within the lumen of the colon based on colon CCE images.",
    "pages": "E1264-E1268",
    "number": "08",
    "volume": "09",
    "publisher": "Georg Thieme Verlag KG",
    "day": "16",
    "month": "Jul",
    "year": "<strong>2021</strong>",
    "journal": "Endosc Int Open",
    "title": "Artificial intelligence and colon capsule endoscopy: automatic detection of blood in colon capsule endoscopy using a convolutional neural network",
    "author": "Mascarenhas Saraiva, Miguel; <strong>Ferreira, J P S</strong> ; Cardoso, Hélder; Afonso, João; Ribeiro, Tiago; Andrade, Patrícia; Parente, Marco P. L.; Jorge, Renato N.; Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Saraiva2021aaa",
    "note": "(<strong>FI: 2.700</strong>)",
    "year": "<strong>2021</strong>",
    "url": "https://doi.org/10.1007/s10151-021-02517-5",
    "title": "Artificial intelligence and colon capsule endoscopy: development of an automated diagnostic system of protruding lesions in colon capsule endoscopy",
    "journal": "Techniques in Coloproctology",
    "issn": "1128-045X",
    "doi": "10.1007/s10151-021-02517-5",
    "author": "Saraiva, M M and <strong>Ferreira</strong>, <strong>J P S </strong> and Cardoso, H and Afonso, J and Ribeiro, T and Andrade, P and Parente, M P L and Jorge, R N and Macedo, G",
    "abstract": "Colon capsule endoscopy (CCE) is a minimally invasive alternative for patients unwilling to undergo conventional colonoscopy, or for whom the latter exam is contraindicated. This is particularly important in the setting of colorectal cancer screening. Nevertheless, these exams produce large numbers of images, and reading them is a monotonous and time-consuming task, with the risk of overlooking important lesions. The development of automated tools based on artificial intelligence (AI) technology may improve some of the drawbacks of this diagnostic instrument."
  },
  {
    "type": "article",
    "key": "MascarenhasSaraiva2021",
    "note": "(<strong>FI: 9.4</strong>)",
    "year": "<strong>2021</strong>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0016510721016199",
    "title": "Artificial intelligence for automatic diagnosis of biliary strictures malignancy status in single-operator cholangioscopy: a pilot study",
    "journal": "Gastrointestinal Endoscopy",
    "issn": "0016-5107",
    "doi": "https://doi.org/10.1016/j.gie.2021.08.027",
    "author": "Mascarenhas Saraiva, Miguel and Ribeiro, Tiago and <strong>Ferreira</strong>, <strong>Joao P S </strong> and Vilas Boas Silva, Filipe and Afonso, João and Santos, Ana Luísa and Parente, Marco P L and Jorge, Renato N and Pereira, Pedro and Macedo, Guilherme",
    "abstract": "Background and aims Diagnosis and characterization of biliary strictures is challenging. The introduction of digital single-operator cholangioscopy (DSOC) allowing direct visual inspection of the lesion and targeted biopsies significantly improved the diagnostic yield in patients with indeterminate biliary strictures. However, the diagnostic efficiency of DSOC remains suboptimal. Convolutional neural networks (CNNs) have shown great potential for the interpretation of medical images. We aimed to develop a CNN-based system for automatic detection of malignant biliary strictures in DSOC images. Methods We developed, trained, and validated a CNN based on DSOC images. Each frame was labeled as normal/benign findings or as a malignant lesion if histopathological evidence of biliary malignancy was available. The entire dataset was split for 5-fold cross validation. In addition, the image dataset was split for constitution of training and validation datasets. The performance of the CNN was measured by calculating the area under the receiving operating characteristic curve (AUC), sensitivity, specificity, positive, and negative predictive values (PPV and NPV, respectively). Results A total of 11855 images from 85 patients were included (9695 of malignant strictures and 2160 of benign findings). The model had an overall accuracy of 94.9%, a sensitivity of 94.7%, a specificity of 92.1% and an AUC of 0.988 in cross-validation analysis. The image processing speed of the CNN was 7 ms/frame. Conclusions The developed deep learning algorithm accurately detected and differentiated malignant strictures from benign biliary conditions. The introduction of artificial intelligence algorithms to DSOC systems may significantly increase its diagnostic yield for malignant strictures."
  },
  {
    "type": "article",
    "key": "ferreira2021_crohn",
    "note": "(<strong>FI: 8.7</strong>)",
    "url": "https://doi.org/10.1093/ecco-jcc/jjab117",
    "doi": "10.1093/ecco-jcc/jjab117",
    "issn": "1873-9946",
    "month": "07",
    "year": "<strong>2021</strong>",
    "journal": "Journal of Crohn's and Colitis",
    "title": "Identification of ulcers and erosions by the novel Pillcam Crohn's Capsule using a convolutional neural network: a multicentre pilot study",
    "author": "<strong>Joao P S Ferreira</strong> and Mascarenhas Saraiva, Miguel JQC and Afonso, Joao PL and Ribeiro, Tiago FC and Cardoso, Helder Manuel Casal and Ribeiro Andrade, Ana Patricia and de Mascarenhas Saraiva, Miguel Nuno Gameiro and Parente, Marco Paulo Lages and Natal Jorge, Renato and Lopes, Susana Isabel Oliveira and de Macedo, Guilherme Manuel Goncalves"
  },
  {
    "type": "article",
    "key": "afonso21_tige",
    "note": "(<strong>FI: 1.2</strong>)",
    "keywords": "Capsule endoscopy, Artificial intelligence, Convolutional neural network, Ulcers, Gastrointestinal bleeding",
    "author": "João Afonso and Miguel Jose Mascarenhas Saraiva and <strong>J P S Ferreira</strong> and Helder Cardoso and Tiago Ribeiro and Patricia Andrade and Marco Parente and Renato N. Jorge and Miguel Mascarenhas Saraiva and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S2590030721000416",
    "doi": "https://doi.org/10.1016/j.tige.2021.06.003",
    "month": "June",
    "issn": "2590-0307",
    "year": "<strong>2021</strong>",
    "journal": "Techniques and Innovations in Gastrointestinal Endoscopy",
    "title": "Development of a convolutional neural network for detection of erosions and ulcers with distinct bleeding potential in capsule endoscopy"
  },
  {
    "type": "article",
    "key": "AFONSO2021",
    "note": "(<strong>FI: 5.165</strong>)",
    "author": "Joao Afonso and Miguel Mascarenhas Saraiva and <strong>Joao P S Ferreira</strong> and Tiago Ribeiro and Hélder Cardoso and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S1590865821000402",
    "doi": "https://doi.org/10.1016/j.dld.2021.01.025",
    "issn": "1590-8658",
    "month": "February",
    "year": "<strong>2021</strong>",
    "journal": "Digestive and Liver Disease",
    "title": "Performance of a convolutional neural network for automatic detection of blood and hematic residues in small bowel lumen"
  },
  {
    "type": "article",
    "key": "Saraiva2021_82383bn",
    "url": "https://doi.org/10.1016/j.gie.2021.03.895",
    "doi": "10.1016/j.gie.2021.03.895",
    "issn": "0016-5107",
    "pages": "AB351-AB352",
    "number": "6",
    "volume": "93",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2021</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3526753 DEEP LEARNING AND CAPSULE ENDOSCOPY: AUTOMATIC DETECTION OF ULCERS AND ENTERIC EROSIONS IN CAPSULE ENDOSCOPY USING A CONVOLUTIONAL NEURAL NETWORK",
    "author": "Saraiva, Miguel M. and Cardoso, Helder and Afonso, João and <strong>Ferreira, João</strong> and Andrade, Patrícia and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Afonso2021_9823838",
    "url": "https://doi.org/10.1016/j.gie.2021.03.443",
    "doi": "10.1016/j.gie.2021.03.443",
    "issn": "0016-5107",
    "pages": "AB197-AB198",
    "number": "6",
    "volume": "93",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2021</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3525280 AUTOMATIC DETECTION OF ENTERIC PROTRUDING LESIONS IN CAPSULE ENDOSCOPY USING A CONVOLUCIONAL NEURAL NETWORK",
    "author": "Afonso, João and Saraiva, Miguel M. and Cardoso, Helder and <strong>Ferreira, João</strong> and Andrade, Patrícia and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Afonso2021_jdus7",
    "url": "https://doi.org/10.1016/j.gie.2021.03.432",
    "doi": "10.1016/j.gie.2021.03.432",
    "issn": "0016-5107",
    "pages": "AB190-AB191",
    "number": "6",
    "volume": "93",
    "publisher": "Elsevier",
    "day": "01",
    "month": "Jun",
    "year": "<strong>2021</strong>",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3525204 ARTIFICIAL INTELLIGENCE AND VIDEO CAPSULE COLONOSCOPY: AUTOMATIC DETECTION OF BLOOD IN COLONIC LUMEN USING A CONVOLUCIONAL NEURAL NETWORK",
    "author": "Afonso, João and Saraiva, Miguel M. and Cardoso, Helder and <strong>Ferreira, João</strong> and Andrade, Patrícia and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "ribeirop113_2021",
    "url": "https://doi.org/10.1093/ecco-jcc/jjab076.240",
    "doi": "10.1093/ecco-jcc/jjab076.240",
    "issn": "1873-9946",
    "month": "05",
    "year": "<strong>2021</strong>",
    "pages": "S205-S206",
    "number": "1, Supplement",
    "volume": "15",
    "journal": "Journal of Crohn's and Colitis",
    "title": "P113 Automatic detection of colonic ulcers and erosions in colon capsule endoscopy images using a convolutional neural network",
    "author": "Ribeiro, T and Mascarenhas Saraiva, M and Afonso, J and Cardoso, H and <strong>Ferreira, J</strong> and Andrade, P and Jorge, R and Lopes, S and Macedo, G"
  },
  {
    "type": "article",
    "key": "saraivadop90_2021",
    "url": "https://doi.org/10.1093/ecco-jcc/jjab073.119",
    "doi": "10.1093/ecco-jcc/jjab073.119",
    "issn": "1873-9946",
    "month": "05",
    "year": "<strong>2021</strong>",
    "pages": "S111-S112",
    "number": "1, Supplement",
    "volume": "15",
    "journal": "Journal of Crohn's and Colitis",
    "title": "DOP80 Automatic detection of ulcers and erosions in PillCam Crohn's capsule using a convolutional neural network",
    "author": "Saraiva, M and Ribeiro, T and Afonso, J and Cardoso, H and <strong>Ferreira, J</strong> and Andrade, P and Parente, M and Jorge, R and Lopes, S and Macedo, G"
  },
  {
    "type": "article",
    "key": "afonsop188_2021",
    "url": "https://doi.org/10.1093/ecco-jcc/jjab076.315",
    "doi": "10.1093/ecco-jcc/jjab076.315",
    "issn": "1873-9946",
    "month": "05",
    "year": "<strong>2021</strong>",
    "pages": "S257-S258",
    "number": "1, Supplement",
    "volume": "15",
    "journal": "Journal of Crohn's and Colitis",
    "title": "P188 Artificial Intelligence and Colon Capsule Endoscopy: Automatic detection of colonic mucosal lesions and blood using a convolutional neural network",
    "author": "Afonso, J and Mascarenhas, M and Ribeiro, T and Cardoso, H and <strong>Ferreira, J</strong> and Andrade, P and Jorge, R and Lopes, S and Macedo, G"
  },
  {
    "type": "article",
    "key": "AFONSO2021AB190",
    "author": "Joao Afonso and Miguel M. Saraiva and Helder Cardoso and <strong>Joao Ferreira</strong> and Patricia Andrade and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S001651072100674X",
    "doi": "https://doi.org/10.1016/j.gie.2021.03.432",
    "issn": "0016-5107",
    "note": "2021 DDW Abstract Issue",
    "year": "<strong>2021</strong>",
    "pages": "AB190-AB191",
    "number": "6, Supplement",
    "volume": "93",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3525204 ARTIFICIAL INTELLIGENCE AND VIDEO CAPSULE COLONOSCOPY: AUTOMATIC DETECTION OF BLOOD IN COLONIC LUMEN USING A CONVOLUTIONAL NEURAL NETWORK"
  },
  {
    "type": "article",
    "key": "SARAIVA2021AB351",
    "author": "Miguel M. Saraiva and Helder Cardoso and Joao Afonso and <strong>Joao Ferreira</strong> and Patricia Andrade and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S0016510721011378",
    "doi": "https://doi.org/10.1016/j.gie.2021.03.895",
    "issn": "0016-5107",
    "note": "2021 DDW Abstract Issue",
    "year": "<strong>2021</strong>",
    "pages": "AB351-AB352",
    "number": "6, Supplement",
    "volume": "93",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3526753 DEEP LEARNING AND CAPSULE ENDOSCOPY: AUTOMATIC DETECTION OF ULCERS AND ENTERIC EROSIONS IN CAPSULE ENDOSCOPY USING A CONVOLUTIONAL NEURAL NETWORK"
  },
  {
    "type": "article",
    "key": "AFONSO2021AB197",
    "author": "Joao Afonso and Miguel M. Saraiva and Helder Cardoso and <strong>Joao Ferreira</strong> and Patri­cia Andrade and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S0016510721006854",
    "doi": "https://doi.org/10.1016/j.gie.2021.03.443",
    "issn": "0016-5107",
    "note": "2021 DDW Abstract Issue",
    "year": "<strong>2021</strong>",
    "pages": "AB197-AB198",
    "number": "6, Supplement",
    "volume": "93",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3525280 AUTOMATIC DETECTION OF ENTERIC PROTRUDING LESIONS IN CAPSULE ENDOSCOPY USING A CONVOLUCIONAL NEURAL NETWORK"
  },
  {
    "type": "article",
    "key": "SARAIVA2021AB98",
    "author": "Miguel M. Saraiva and Helder Cardoso and Joao Afonso and <strong>Joao Ferreira</strong> and Patricia Andrade and Guilherme Macedo",
    "url": "https://www.sciencedirect.com/science/article/pii/S0016510721004922",
    "doi": "https://doi.org/10.1016/j.gie.2021.03.250",
    "issn": "0016-5107",
    "note": "2021 DDW Abstract Issue",
    "year": "<strong>2021</strong>",
    "pages": "AB98-AB99",
    "number": "6, Supplement",
    "volume": "93",
    "journal": "Gastrointestinal Endoscopy",
    "title": "ID: 3526558 ARTIFICIAL INTELLIGENCE AND COLON CAPSULE ENDOSCOPY: AUTOMATIC DETECTION OF COLONIC PROTUBERANT LESIONS USING A CONVOLUTIONAL NEURAL NETWORK"
  },
  {
    "type": "inproceedings",
    "key": "mascarenhas_rice2021",
    "year": "<strong>2021</strong>",
    "booktitle": "Reunión Ibérica De Cápsula Endoscópica Y Enteroscopia, RICE 2021, Online. 21 January",
    "title": "Automatic detection of blood and other significant colonic lesions in colon capsule endoscopy using a convolutional neural network",
    "author": "Mascarenhas Saraiva, M and Cardoso, H and Afonso, J and Ribeiro, T and <strong>Ferreira, J P S</strong> and Jorge, R M Natal and Macedo, Guilherme"
  },
  {
    "type": "inproceedings",
    "key": "afonso_rice2021",
    "year": "<strong>2021</strong>",
    "booktitle": "Reunión Ibérica De Cápsula Endoscópica Y Enteroscopia, RICE 2021, Online. 21 January",
    "title": "Artificial intelligence and colon capsule endoscopy: automatic detection of colonic protuberant lesions using a convolutional neural network",
    "author": "Afonso, J and Mascarenhas Saraiva, M and Cardoso, H and Ribeiro, T and <strong>Ferreira, J P S</strong> and Jorge, R M Natal and Macedo, Guilherme"
  },
  {
    "type": "inproceedings",
    "key": "ribeiro_rice2021",
    "year": "<strong>2021</strong>",
    "booktitle": "Reunión Ibérica De Cápsula Endoscópica Y Enteroscopia, RICE 2021, Online. 21 January",
    "title": "Automatic detection of blood and hematic residues in enteric lumen using a convolutional neural network",
    "author": "Ribeiro, T and Mascarenhas Saraiva, M and Cardoso, H and Afonso, J and <strong>Ferreira, J P S</strong> and Jorge, R M Natal and Macedo, Guilherme"
  },
  {
    "type": "inproceedings",
    "key": "mvpcmbbe2021",
    "year": "<strong>2021</strong>",
    "booktitle": "Reunión Ibérica De Cápsula Endoscópica Y Enteroscopia, RICE 2021, Online. 21 January",
    "title": "Automatic detection of blood and hematic residues in enteric lumen using a convolutional neural network",
    "author": "Ribeiro, T and Mascarenhas Saraiva, M and Cardoso, H and Afonso, J and <strong>Ferreira, J P S</strong> and Jorge, R M Natal and Macedo, Guilherme"
  },
  {
    "type": "phdthesis",
    "key": "jferreira_phdthesis",
    "url": "https://hdl.handle.net/10216/127484",
    "address": "Porto, Portugal",
    "year": "<strong>2020</strong>",
    "school": "Universidade do Porto",
    "title": "A cell-based approach to early detect female pelvic organ prolapse",
    "author": "<strong>Joao P S Ferreira</strong>"
  },
  {
    "type": "article",
    "key": "Ferreira:2020cu",
    "note": "(<strong>FI: 2.800</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1007/s10237-020-01324-5",
    "file": "D58A565B-EFB6-46A7-B307-C04396FEE359.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/D5/D58A565B-EFB6-46A7-B307-C04396FEE359.pdf:application/pdf;D58A565B-EFB6-46A7-B307-C04396FEE359.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/D5/D58A565B-EFB6-46A7-B307-C04396FEE359.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/D5/D58A565B-EFB6-46A7-B307-C04396FEE359.pdf",
    "url": "http://link.springer.com/10.1007/s10237-020-01324-5",
    "abstract": "A mechanical model is presented to analyze the mechanics and dynamics of the cell cortex during indentation. We investigate the impact of active contraction on the cross-linked actin network for different probe sizes and indentation rates. The essential molecular mechanisms of filament stretching, cross-linking and motor activity, are represented by an active and viscous mechanical continuum. The filaments behave as worm-like chains linked either by passive rigid linkers or by myosin motors. In the first example, the effects of probe size and loading rate are evaluated using the model for an idealized rounded cell shape in which properties are based on the results of parallel-plate rheometry available in the literature. Extreme cases of probe size and indentation rate are taken into account. Afterward, AFM experiments were done by engaging smooth muscle cells with both sharp and spherical probes. By inverse analysis with finite element software, our simulations mimicking the experimental conditions show the model is capable of fitting the AFM data. The results provide spatiotemporal dependence on the size and rate of the mechanical stimuli. The model captures the general features of the cell response. It characterizes the actomyosin cortex as an active solid at short timescales and as a fluid at longer timescales by showing (1) higher levels of contraction in the zones of high curvature; (2) larger indentation forces as the probe size increases; and (3) increase in the apparent modulus with the indentation depth but no dependence on the rate of the mechanical stimuli. The methodology presented in this work can be used to address and predict microstructural dependence on the force generation of living cells, which can contribute to understanding the broad spectrum of results in cell experiments.",
    "date-modified": "2020-06-01T13:30:48GMT",
    "date-added": "2020-05-01T10:53:57GMT",
    "rating": "5",
    "language": "English",
    "doi": "10.1007/s10237-020-01324-5",
    "publisher": "Springer Berlin Heidelberg",
    "month": "April",
    "pages": "202–19",
    "number": "10",
    "volume": "130",
    "year": "<strong>2020</strong>",
    "journal": "Biomechanics and Modeling in Mechanobiology",
    "title": "On the mechanical response of the actomyosin cortex during cell indentations",
    "author": "<strong>Ferreira, Joao P S</strong> and Kuang, Mei and Marques, Marco and Parente, Marco P L and Damaser, Margot S and Natal Jorge, Renato M"
  },
  {
    "type": "article",
    "key": "Ferreira:2020hd",
    "note": "(<strong>FI: 7.242</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1016/j.actbio.2020.03.046",
    "file": "F9CF1738-17A7-49B0-8D4E-9EA7A06D32EC.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/F9/F9CF1738-17A7-49B0-8D4E-9EA7A06D32EC.pdf:application/pdf;F9CF1738-17A7-49B0-8D4E-9EA7A06D32EC.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/F9/F9CF1738-17A7-49B0-8D4E-9EA7A06D32EC.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/F9/F9CF1738-17A7-49B0-8D4E-9EA7A06D32EC.pdf",
    "url": "http://eutils.ncbi.nlm.nih.gov/entrez/eutils/elink.fcgi?dbfrom=pubmed&id=32335309&retmode=ref&cmd=prlinks",
    "abstract": "The remodeling mechanisms that causes connective tissue of the vaginal wall, consisting mostly of smooth muscle, to weaken after vaginal delivery are not fully understood. Abnormal remodeling after delivery can contribute to development of pelvic organ prolapse and other pelvic floor disorders. The present study used vaginal smooth muscle cells (vSMCs) isolated from knockout mice lacking the expression of the lysil oxidase-like1 (LOXL1) enzyme, a well-characterized animal model for pelvic organ prolapse. We tested if vaginal smooth muscle cells from from LOXL1 knockout mice have altered mechanics including stiffness and surface adhesion. Using atomic force microscopy, we performed nanoindentations on both isolated and confluent cells to evaluate the effect of LOXL1 knockout on in vitro cultures of vSMCs cells from nulliparous mice. The results show that LOXL1 knockout vSMCs have increased stiffness in pre-confluent but decreased stiffness in confluent cultures (p*<0.05) and significant decreased surface adhesion in pre-confluent cultures (p*<0.05). This study provides evidence that the weakening of vaginal connective tissue in the absense of LOXL1 changes the mechanical properties of the vSMCs.",
    "date-modified": "2020-06-01T13:29:03GMT",
    "date-added": "2020-04-24T11:55:49GMT",
    "rating": "5",
    "read": "Yes",
    "language": "English",
    "pmid": "32335309",
    "doi": "10.1016/j.actbio.2020.03.046",
    "affiliation": "Department of Mechanical Engineering, Faculty of Engineering, University of Porto, Porto, Portugal; Institute of Science and Innovation in Mechanical and Industrial Engineering, Porto, Portugal; Department of Biomedical Engineering, Lerner Research Institute and Glickman Urological Institute, Cleveland Clinic Foundation, Ohio, USA.",
    "month": "April",
    "year": "<strong>2020</strong>",
    "journal": "Acta Biomaterialia",
    "title": "Altered mechanics of vaginal smooth muscle cells due to the lysyl oxidase-like1 knockout.",
    "author": "<strong>Ferreira, J P S</strong> and Kuang, M and Parente, M P L and Jorge, R M Natal and Wang, R and Eppell, S J and Damaser, M"
  },
  {
    "type": "article",
    "key": "LopezCampos:2020ki",
    "note": "(<strong>FI: 1.502</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1080/10255842.2019.1710742",
    "file": "D4C1F277-C03D-454C-AE31-4420C65A423A.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/D4/D4C1F277-C03D-454C-AE31-4420C65A423A.pdf:application/pdf;D4C1F277-C03D-454C-AE31-4420C65A423A.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/D4/D4C1F277-C03D-454C-AE31-4420C65A423A.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/D4/D4C1F277-C03D-454C-AE31-4420C65A423A.pdf",
    "url": "https://www.tandfonline.com/doi/full/10.1080/10255842.2019.1710742",
    "abstract": "In this paper, we characterized the hyperelastic and damage behavior of the Extensor Digitorum Longus (EDL) human tendon under loading conditions. The study was conducted in both categories of models, phenomenological and physically motivated, to allow the prediction and the macroscopic response of the tendon under specific loading conditions, assuming that its response follows a hyperelastic anisotropic model in conjunction with damage law. We benchmarked multiple hyperelastic and damage models to fit the response of the tendons in uniaxial tensile loading conditions, and by employing a genetic algorithm, we obtained the material parameters for both elastic and damage models. The objective of this study was to explore different mathematical models to determine which would be the best option to predict the behavior of tendons and ligaments in complex biological systems using Finite Elements (FE) models. Therefore, we took into account accuracy as well as computational features. We considered the model proposed by Shearer and coupled it with a sigmoid function, which governs the evolution of damage in tendons, as the most appropriate for the fitting of the experimental data. The achieved solution shows to be of high interest attributable to the simplicity of the damage law function and its low computational cost.",
    "date-modified": "2020-05-11T12:20:51GMT",
    "date-added": "2020-01-21T11:06:40GMT",
    "rating": "5",
    "language": "English",
    "pmid": "31958016",
    "doi": "10.1080/10255842.2019.1710742",
    "affiliation": "Departamento de Ingenierı́a Mecánica, Máquinas y Motores Térmicos y Flu\\d́os, Universidade de Vigo, Escola de Enxeñer\\' ́Industrial, Vigo, Spain.",
    "month": "January",
    "pages": "1–11",
    "number": "2",
    "volume": "81",
    "year": "<strong>2020</strong>",
    "journal": "Computer Methods in Biomechanics and Biomedical Engineering",
    "title": "Characterization of hyperelastic and damage behavior of tendons.",
    "author": "López-Campos, J A and <strong>Ferreira, J P S</strong> and Segade, A and Fernández, J R and Natal, R M"
  },
  {
    "type": "inproceedings",
    "key": "mascarenhas_digestiva2020",
    "year": "<strong>2020</strong>",
    "booktitle": "Semana Digestiva Digital 2020, Online. 20-21 November",
    "title": "Detecao automatica de lesoes protuberantes entericas em Endoscopia por Capsula recorrendo a uma Rede Neural Convolucional",
    "author": "Mascarenhas Saraiva, M and Cardoso, H and Afonso, J and <strong>Ferreira, J P S</strong> and Andrade, Patricia and Jorge, R M Natal and Macedo, Guilherme"
  },
  {
    "type": "article",
    "key": "Ferreira:2019it",
    "note": "(<strong>FI: 2.831</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1002/jbm.b.34534",
    "file": "2D1229BC-12BD-4BA0-A686-CE7695B9EB2B.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/2D/2D1229BC-12BD-4BA0-A686-CE7695B9EB2B.pdf:application/pdf;2D1229BC-12BD-4BA0-A686-CE7695B9EB2B.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/2D/2D1229BC-12BD-4BA0-A686-CE7695B9EB2B.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/2D/2D1229BC-12BD-4BA0-A686-CE7695B9EB2B.pdf",
    "url": "http://eutils.ncbi.nlm.nih.gov/entrez/eutils/elink.fcgi?dbfrom=pubmed&id=31845527&retmode=ref&cmd=prlinks",
    "abstract": "A histologically motivated (HM) coefficient that establishes a link between tissue's microstructure and material model through histological data is used in the prediction of the mechanical properties of vaginal tissue that is subjected to multiaxial loading conditions. Therefore, the material parameters were based on an HM coefficient obtained from tensile testing and histological data of comparable tissues. Uniaxial tensile test data and histological data were collected from three groups of sheep at different time points in their life cycle, including virgins, pregnant, and parous ewes. From this data, a correlation between material parameters and histological data was obtained. Spherical indentation (ball burst [BB]) tests were then performed in specimens with similar tissue structure. The histological data of these samples were used in conjunction with the correlations already established for the uniaxial samples data, to define the material parameters of the BB samples. Mechanical properties of the BB specimens were predicted through basic histology and using finite element modeling (FEM) simulations, without direct mechanical measurements. The predicted force and displacement values of the FEM simulation displayed a good correlation with the experimental (BB) testing results. No fitting of the BB results was performed. In this way, the use of uniaxial tests coupled with useful histological information offers a promising approach to predicting macroscopic material behavior under multiaxial loading conditions in biomechanics.",
    "date-modified": "2020-01-09T13:04:02GMT",
    "date-added": "2020-01-09T13:02:43GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "pmid": "31845527",
    "doi": "10.1002/jbm.b.34534",
    "affiliation": "Mechanical Engineering Department, Faculty of Engineering, University of Porto, Porto, Portugal.",
    "month": "December",
    "year": "<strong>2019</strong>",
    "journal": "Journal of Biomedical Materials Research Part B: Applied Biomaterials",
    "title": "Predicting the mechanical response of the vaginal wall in ball burst tests based on histology.",
    "author": "<strong>Ferreira, Joao P S</strong> and Rynkevic, Rita and Martins, Pedro A L S and Parente, Marco P L and Famaey, Nele M and Deprest, Jan and Fernandes, Antonio A"
  },
  {
    "type": "article",
    "key": "Oliveira:2019ea",
    "note": "(<strong>FI: 3.089</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1098/rsfs.2019.0027",
    "url": "http://eutils.ncbi.nlm.nih.gov/entrez/eutils/elink.fcgi?dbfrom=pubmed&id=31485314&retmode=ref&cmd=prlinks",
    "abstract": "Childbirth-related injuries are one of the main causes of pelvic floor dysfunction. To attempt to avoid serious tears during delivery, an episiotomy can be performed. In this study, we intended to investigate the biomechanical performance of the pelvic floor muscles after performing different episiotomies using a physics-based computational model which includes the pelvic floor muscles and the fetus. Previous biomechanical studies have analysed the mechanical effects of single incisions of different lengths; in this study, we intend to analyse the implications of multiple small incisions, evaluating the reaction forces, the stress on the muscles and the loss of tissue integrity sustained by the pelvic floor. The obtained results predict that an episiotomy delivery reduces the likelihood of macroscopic levator trauma by decreasing the stress on the region of insertion of the rectal area of the levator ani in the symphysis pubis. From the mechanical point of view, multiple incisions do not bring benefits compared to larger incisions. However, nothing can be ascertained about the clinical benefit of such an approach.",
    "date-modified": "2019-09-29T21:02:50GMT",
    "date-added": "2019-09-29T21:02:31GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "pmcid": "PMC6710650",
    "pmid": "31485314",
    "doi": "10.1098/rsfs.2019.0027",
    "affiliation": "Institute of Science and Innovation in Mechanical and Industrial Engineering (INEGI), Porto, Portugal.",
    "month": "October",
    "pages": "20190027",
    "number": "5",
    "volume": "9",
    "year": "<strong>2019</strong>",
    "journal": "Interface Focus",
    "title": "Episiotomy: the biomechanical impact of multiple small incisions during a normal vaginal delivery.",
    "author": "Oliveira, Dulce and Pouca, Maria Vila and <strong>Ferreira, Joao P S</strong> and Mascarenhas, Teresa"
  },
  {
    "type": "article",
    "key": "Pouca:2019hj",
    "note": "(<strong>FI: 2.527</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1007/s10237-019-01117-5",
    "file": "Biomech_Model_Mechanobiol_2019_Pouca.pdf:/Users/jferreira/Google Drive/Library.papers3/Articles/2019/Pouca/Biomech_Model_Mechanobiol_2019_Pouca.pdf:application/pdf;Biomech_Model_Mechanobiol_2019_Pouca.pdf:/Users/jferreira/Google Drive/Library.papers3/Articles/2019/Pouca/Biomech_Model_Mechanobiol_2019_Pouca.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Articles/2019/Pouca/Biomech_Model_Mechanobiol_2019_Pouca.pdf",
    "url": "http://link.springer.com/10.1007/s10237-019-01117-5",
    "abstract": "During vaginal delivery women sustain stretching of their pelvic floor, risking tissue injury and adverse outcomes. Since studies in pregnant women are limited with ethical constraints, computational models have become an interesting alternative to elucidate the pregnancy mechanisms. This research investigates the uterine contractions during foetus expulsion without an imposed trajectory. Such physical process is captured by means of a chemo-mechanical constitutive model, where the uterine contractions are triggered by chemical stimuli. The foetus descent, which includes both pushing and resting stages, has a descent rate within the physiological range. Moreover, the behaviour of the foetus and the uterus stretch agree well with clinical data presented in the literature. The follow-up of this study will be to obtain a complete childbirth simulation, considering also the pelvic floor muscles and its supporting structures. The simulation of a realistic rate of descent, including the pushing and resting stages, is of significant importance to study the pelvic floor muscles due to their viscoelastic nature.",
    "date-modified": "2019-09-29T20:57:44GMT",
    "date-added": "2019-01-12T19:17:45GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "pmid": "30635851",
    "doi": "10.1007/s10237-019-01117-5",
    "affiliation": "Faculty of Engineering, University of Porto, R. Dr. Roberto Frias, s/n, 4200, Oporto, Portugal. mariavp@fe.up.pt.",
    "month": "June",
    "pages": "829–843",
    "number": "3",
    "volume": "18",
    "year": "<strong>2019</strong>",
    "journal": "Biomechanics and Modeling in Mechanobiology",
    "title": "Simulation of the uterine contractions and foetus expulsion using a chemo-mechanical constitutive model.",
    "author": "Vila Pouca, M C P and <strong>Ferreira, J P S</strong> and Oliveira, D A and Parente, M P L and Mascarenhas, M T and Natal Jorge, R M"
  },
  {
    "type": "inproceedings",
    "key": "rynkevic_mips2019",
    "year": "<strong>2019</strong>",
    "booktitle": "MIPS Annual Meeting at Barcelona, April 25-27",
    "title": "Simulations of vaginal tissue: application of the histologically-motivated coefficient to multiaxial loading conditions",
    "author": "Rynkevic, R and Martins, PALSM and <strong>Ferreira, J P S</strong> and Parente, M P L and Mascarenhas, T and Fernandes, AA"
  },
  {
    "type": "inproceedings",
    "key": "vilapouca_cmn2019",
    "pages": "550",
    "year": "<strong>2019</strong>",
    "series": "eBook",
    "booktitle": "Congress on Numerical Methods in Engineering, CMN 2019, Guimarães, Portugal, July 01-03",
    "editor": "P, Lourenço and P, Flores and S, Clain",
    "title": "On the numerical simulation of the uterine contractions and foetus expulsion using a chemomechanical constitutive model",
    "author": "Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Oliveira, DA and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_complas2019",
    "year": "<strong>2019</strong>",
    "booktitle": "XV International Conference on Computational Plasticity, Barcelona, 3-5 September",
    "editor": "E Oñate and DRJ Owen, D and Peric, M Chiumenti",
    "title": "Investigating the nanomechanical properties of living smooth muscle cells by atomic force miscroscopy and numerical simulations",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_aua2019",
    "year": "<strong>2019</strong>",
    "booktitle": "American Urology Association, AUA2019, Chicago, Illinois, 2-6 May",
    "title": "Stiffness of vaginal smooth muscle cells: Loxl1 knockout vs wildtype",
    "author": "<strong>Ferreira, J P S</strong> and Kuang, M and Hu, C and Parente, M P L and Jorge R M Natal and Eppell SJ and Damaser, MS"
  },
  {
    "type": "article",
    "key": "Rynkevic:2018ky",
    "note": "(<strong>FI: 2.320</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1016/j.jbiomech.2018.10.038",
    "file": "F9BDE81E-0917-4532-B531-D0C660E28DCA.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/F9/F9BDE81E-0917-4532-B531-D0C660E28DCA.pdf:application/pdf;F9BDE81E-0917-4532-B531-D0C660E28DCA.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/F9/F9BDE81E-0917-4532-B531-D0C660E28DCA.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/F9/F9BDE81E-0917-4532-B531-D0C660E28DCA.pdf",
    "url": "https://linkinghub.elsevier.com/retrieve/pii/S0021929018308273",
    "abstract": "Mechanical characterization of living tissues and computer-based simulations related to medical issues, has become increasingly important to improve dłdots",
    "date-modified": "2018-11-19T10:59:21GMT",
    "date-added": "2018-11-08T18:37:21GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "doi": "10.1016/j.jbiomech.2018.10.038",
    "publisher": "Elsevier",
    "month": "November",
    "year": "<strong>2018</strong>",
    "journal": "Journal of Biomechanics",
    "title": "Linking hyperelastic theoretical models and experimental data of vaginal tissue through histological data",
    "author": "Rynkevic, Rita and <strong>Ferreira, Joao P S</strong> and Martins, Pedro and Parente, Marco and Fernandes, Antonio A"
  },
  {
    "type": "article",
    "key": "Azinpour:2018fz",
    "note": "(<strong>FI: 3.500</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1186/s40323-018-0106-7",
    "file": "9AC3CB7E-68B9-4029-BDD4-8BC87CBA6D54.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/9A/9AC3CB7E-68B9-4029-BDD4-8BC87CBA6D54.pdf:application/pdf;9AC3CB7E-68B9-4029-BDD4-8BC87CBA6D54.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/9A/9AC3CB7E-68B9-4029-BDD4-8BC87CBA6D54.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Files/9A/9AC3CB7E-68B9-4029-BDD4-8BC87CBA6D54.pdf",
    "url": "https://amses-journal.springeropen.com/articles/10.1186/s40323-018-0106-7",
    "date-modified": "2018-06-07T18:51:55GMT",
    "date-added": "2018-05-22T07:47:29GMT",
    "rating": "5",
    "read": "Yes",
    "language": "English",
    "doi": "10.1186/s40323-018-0106-7",
    "month": "May",
    "pages": "83",
    "number": "1",
    "volume": "5",
    "year": "<strong>2018</strong>",
    "journal": "Advanced Modeling and Simulation in Engineering Sciences",
    "title": "A simple and unified implementation of phase field and gradient damage models",
    "author": "Azinpour, E and <strong>Ferreira, J P S</strong> and Parente, M P L and de Sa, J Cesar"
  },
  {
    "type": "article",
    "key": "VilaPouca:2018jv",
    "note": "(<strong>FI: 3.485</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1016/j.jmbbm.2018.08.011",
    "url": "https://linkinghub.elsevier.com/retrieve/pii/S175161611830660X",
    "abstract": "Injuries sustained by the pelvic floor muscles during childbirth are one of the major risk factors for the development of pelvic floor dysfunctions. Tłdots",
    "date-modified": "2018-08-12T16:31:29GMT",
    "date-added": "2018-08-12T16:30:41GMT",
    "rating": "5",
    "read": "Yes",
    "language": "English",
    "doi": "10.1016/j.jmbbm.2018.08.011",
    "publisher": "Elsevier",
    "month": "August",
    "year": "<strong>2018</strong>",
    "journal": "Journal of the Mechanical Behavior of Biomedical Materials",
    "title": "On the effect of labour durations using an anisotropic visco-hyperelastic-damage approach to simulate vaginal deliveries",
    "author": "Vila Pouca, M C P and <strong>Ferreira, J P S</strong> and Oliveira, D A and Parente, M P L and Mascarenhas, Teresa and Natal Jorge, R M"
  },
  {
    "type": "article",
    "key": "VilaPouca:2017gx",
    "note": "(<strong>FI: 2.082</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1002/cnm.2927",
    "file": "Int._J._Numer._Meth._Biomed._Engng._2017_Vila_Pouca.pdf:/Users/jferreira/Google Drive/Library.papers3/Articles/2017/Vila_Pouca/Int._J._Numer._Meth._Biomed._Engng._2017_Vila_Pouca.pdf:application/pdf;Int._J._Numer._Meth._Biomed._Engng._2017_Vila_Pouca.pdf:/Users/jferreira/Google Drive/Library.papers3/Articles/2017/Vila_Pouca/Int._J._Numer._Meth._Biomed._Engng._2017_Vila_Pouca.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Google%20Drive/Library.papers3/Articles/2017/Vila_Pouca/Int._J._Numer._Meth._Biomed._Engng._2017_Vila_Pouca.pdf",
    "url": "http://doi.wiley.com/10.1002/cnm.2927",
    "abstract": "During vaginal delivery, women sustain stretching of their pelvic floor, risking tissue injury and adverse outcomes. Realistic numerical simulations of childbirth can help in the understanding of the pelvic floor mechanics and on the prevention of related disorders. In previous studies, biomechanical finite element simulations of a vaginal delivery have been performed disregarding the viscous effects present on all biological soft tissues. The inclusion of the viscoelastic behaviour is fundamental, since it allows to investigate rate-dependent responses. The present work uses a viscohyperelastic constitutive model to evaluate how the childbirth duration affects the efforts sustained by the pelvic floor during delivery. It was concluded that viscoelasticity adds a stiffness component that leads to higher forces comparing with the elastic response. Viscous solutions are rate dependent, and precipitous labours could be associated to higher efforts, while lower reaction forces were denoted for normal and prolonged labours, respectively. The existence of resting stages during labour demonstrated the capability of the tissue to relax and recover some of the initial properties, which helped to lower the forces and stresses involved. The present work represents a step further in achieving a robust non-invasive procedure, allowing to estimate how obstetrical factors influence labour and its outcomes.",
    "date-modified": "2019-09-30T14:27:36GMT",
    "date-added": "2018-01-10T15:42:39GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "pmid": "28886617",
    "doi": "10.1002/cnm.2927",
    "affiliation": "Faculdade de Engenharia da Universidade do Porto, Rua Dr. Roberto Frias, s/n, 4200, Porto, Portugal.",
    "month": "March",
    "pages": "e2927",
    "number": "3",
    "volume": "34",
    "year": "<strong>2018</strong>",
    "journal": "International Journal for Numerical Methods in Biomedical Engineering",
    "title": "Viscous effects in pelvic floor muscles during childbirth: A numerical study.",
    "author": "Vila Pouca, M C P and <strong>Ferreira, J P S</strong> and Oliveira, D A and Parente, M P L and Natal Jorge, R M"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_cmbee18",
    "pages": "Abstract ID-87",
    "series": "Book of Abstracts",
    "year": "<strong>2018</strong>",
    "booktitle": "CMBBE2018 - 15th International Symposium on Computer Methods in Biomechanics and Biomedical Engineering and 3rd Conference on Imaging and Visualization, Lisbon, 26-29 March",
    "editor": "Fernandes, PR and Tavares, JMRS",
    "title": "Modelling of cross-linking dynamics in actin networks",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "vilapouca_cmbee18",
    "pages": "Abstract ID-199",
    "series": "Book of Abstracts",
    "year": "<strong>2018</strong>",
    "booktitle": "CMBBE2018 - 15th International Symposium on Computer Methods in Biomechanics and Biomedical Engineering and 3rd Conference on Imaging and Visualization, Lisbon, 26-29 March",
    "editor": "Fernandes, PR and Tavares, JMRS",
    "title": "On the anisotropic visco-hyperelastic modelling of the pelvic floor muscles during childbirth",
    "author": "Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Oliveira, DA and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "vilapouca_esmc18",
    "year": "<strong>2018</strong>",
    "booktitle": "ESMC2018 - 10th European Solid Mechanics Conference, Bologna, Italy, 2-6 July",
    "title": "Simulation of the foetus expulsion using a chemo-mechanical model to reproduce the uterine contractions",
    "author": "Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Oliveira, DA and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_esmc18",
    "year": "<strong>2018</strong>",
    "booktitle": "ESMC2018 - 10th European Solid Mechanics Conference, Bologna, Italy, 2-6 July",
    "title": "Modelling of cross-linking dynamics in actomyosin networks",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "rnatal_wcb18",
    "year": "<strong>2018</strong>",
    "booktitle": "WCB 2018 – 8th World Congress of Biomechanics,Dublin, Ireland, 8-12 July",
    "title": "The importance of time during vaginal childbirth",
    "author": "Jorge R M Natal and Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Oliveira, DA and Mascarenhas, T and Parente, M P L"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_wcb18",
    "year": "<strong>2018</strong>",
    "booktitle": "WCB 2018 – 8th World Congress of Biomechanics,Dublin, Ireland, 8-12 July",
    "title": "A biomechanical model for actomyosin networks",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "rynkevic_mips2018",
    "year": "<strong>2018</strong>",
    "booktitle": "V MIPS Annual Meeting at Rome, May 3-5",
    "title": "Accurate in silico simulation of the ovine bladder based on mechanical and histological data",
    "author": "Rynkevic, R and Martins, PALSM and <strong>Ferreira, J P S</strong> and Parente, M P L and Mascarenhas, T and Fernandes, AA"
  },
  {
    "type": "inproceedings",
    "key": "rynkevic_iuga2018",
    "year": "<strong>2018</strong>",
    "booktitle": "43th Internacional Urogynecology annual meeting (IUGA), Viena, June 27-30",
    "title": "A histological basis for the nonlinear behavior of pelvic tissues",
    "author": "Rynkevic, R and Martins, PALSM and <strong>Ferreira, J P S</strong> and Parente, M P L and Mascarenhas, T and Fernandes, AA"
  },
  {
    "type": "article",
    "key": "Ferreira:2017jm",
    "note": "(<strong>FI: 4.087</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1016/j.jmps.2017.09.009",
    "file": "1F6477C7-D52C-4659-9866-06B715BBE552.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/1F/1F6477C7-D52C-4659-9866-06B715BBE552.pdf:application/pdf;1F6477C7-D52C-4659-9866-06B715BBE552.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/1F/1F6477C7-D52C-4659-9866-06B715BBE552.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Dropbox/Library.papers3/Files/1F/1F6477C7-D52C-4659-9866-06B715BBE552.pdf",
    "url": "http://linkinghub.elsevier.com/retrieve/pii/S0022509617303022",
    "date-modified": "2017-11-15T10:59:54GMT",
    "date-added": "2017-09-28T06:58:10GMT",
    "rating": "5",
    "read": "Yes",
    "language": "English",
    "doi": "10.1016/j.jmps.2017.09.009",
    "year": "<strong>2017</strong>",
    "journal": "Journal of the Mechanics and Physics of Solids",
    "title": "Continuum mechanical model for cross-linked actin networks with contractile bundles",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge, R M Natal"
  },
  {
    "type": "article",
    "key": "Ferreira:2017fz",
    "note": "(<strong>FI: 3.212</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1007/s10237-017-0875-9",
    "file": "7643FA6C-4FED-4FC7-B1F1-1C10CD47DE09.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/76/7643FA6C-4FED-4FC7-B1F1-1C10CD47DE09.pdf:application/pdf;7643FA6C-4FED-4FC7-B1F1-1C10CD47DE09.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/76/7643FA6C-4FED-4FC7-B1F1-1C10CD47DE09.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Dropbox/Library.papers3/Files/76/7643FA6C-4FED-4FC7-B1F1-1C10CD47DE09.pdf",
    "url": "http://link.springer.com/10.1007/s10237-017-0875-9",
    "date-modified": "2017-10-11T13:19:12GMT",
    "date-added": "2017-01-25T08:33:40GMT",
    "rating": "4",
    "read": "Yes",
    "language": "English",
    "doi": "10.1007/s10237-017-0875-9",
    "pages": "5894–1140",
    "number": "18–19",
    "volume": "44",
    "year": "<strong>2017</strong>",
    "journal": "Biomechanics and Modeling in Mechanobiology",
    "title": "A general framework for the numerical implementation of anisotropic hyperelastic material models including non-local damage",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jabareen, M and Jorge, R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_complas17",
    "year": "<strong>2017</strong>",
    "booktitle": "XIV International Conference on Computational Plasticity, Barcelona, 5-7 September",
    "editor": "E, Oñate and Owen, D and Peric, M Chiumenti",
    "title": "Continuum mechanical model for cross-linked actin networks with contractile bundles",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "vilapouca_cnb2017",
    "pages": "199",
    "year": "<strong>2017</strong>",
    "series": "Livro de Resumos",
    "booktitle": "7º Congresso Nacional de Biomecânica, Guimarães, 10-11 Fevereiro 2017",
    "title": "Utilização de modelos constitutivos hiperelásticos com anisotropia para a modelação numérica do Útero",
    "editor": "Flores, P",
    "author": "Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_dce17",
    "year": "<strong>2017</strong>",
    "booktitle": "2nd Doctoral Congress in Engineering, Porto, 8-9 Junho",
    "title": "Constitutive modeling of crosslinked actin networks: overview and implementation",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_4ejil",
    "pages": "64",
    "year": "<strong>2017</strong>",
    "series": "Book of Abstracts",
    "booktitle": "4th LAETA Young Researchers Meeting, Covilhã, 9-10 November",
    "title": "A continuum model for the mechanics of actomyosin networks",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "vilapouca_4ejil",
    "pages": "60",
    "year": "<strong>2017</strong>",
    "series": "Book of Abstracts",
    "booktitle": "4th LAETA Young Researchers Meeting, Covilhã, 9-10 November",
    "title": "Application of anisotropic visco-hyperelastic constitutive models for the simulation of biological tissues",
    "author": "Vila Pouca, MCP and <strong>Ferreira, J P S</strong> and Oliveira, DA and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "article",
    "key": "Ferreira:2016bf",
    "note": "(<strong>FI: 2.040</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1177/1464420716662295",
    "file": "D690AD9A-D541-41CC-89A7-2C67689EE6ED.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/D6/D690AD9A-D541-41CC-89A7-2C67689EE6ED.pdf:application/pdf;D690AD9A-D541-41CC-89A7-2C67689EE6ED.pdf:/Users/jferreira/Dropbox/Library.papers3/Files/D6/D690AD9A-D541-41CC-89A7-2C67689EE6ED.pdf:application/pdf",
    "howpublished": "conf",
    "url": "http://pil.sagepub.com/lookup/doi/10.1177/1464420716662295",
    "abstract": "SAGE Publications",
    "date-modified": "2017-05-31T10:59:43GMT",
    "date-added": "2016-08-05T12:47:00GMT",
    "rating": "5",
    "read": "Yes",
    "language": "English",
    "doi": "10.1177/1464420716662295",
    "publisher": "SAGE Publications",
    "month": "August",
    "pages": "126–139",
    "number": "1-2",
    "volume": "231",
    "year": "<strong>2016</strong>",
    "journal": "Proceedings of the Institution of Mechanical Engineers, Part L: Journal of Materials: Design and Applications",
    "title": "Modeling of soft tissues with damage",
    "author": "<strong>Ferreira, Joao </strong> and Parente, Marco and Jorge, Renato"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_mda16",
    "year": "<strong>2016</strong>",
    "series": "Livro de Resumos",
    "booktitle": "1st International Conference on Materials Design and Applications, Porto, 30 June - 1 July",
    "title": "Modelling of Soft Tissues with Damage",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_cem16",
    "pages": "211-212",
    "year": "<strong>2016</strong>",
    "series": "Proceedings Book",
    "booktitle": "CEM2016 – Mechanical Engineering Conference, Porto, 1-3 June 2016",
    "title": "Strongly-objective modelling of fiber-reinforced hyperelastic materials",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "article",
    "key": "Ferreira:2015jp",
    "note": "(<strong>FI: 1.625</strong>)",
    "uri": "r̆lpapers3://publication/doi/10.1177/1464420715592905",
    "file": "Proceedings of the Institution of Mechanical Engineers Part L Journal of Materials Design and Applications 2015 Ferreira.pdf:/Users/jferreira/Dropbox/Library.papers3/Articles/2015/Ferreira/Proceedings of the Institution of Mechanical Engineers Part L Journal of Materials Design and Applications 2015 Ferreira.pdf:application/pdf;Proceedings of the Institution of Mechanical Engineers Part L Journal of Materials Design and Applications 2015 Ferreira.pdf:/Users/jferreira/Dropbox/Library.papers3/Articles/2015/Ferreira/Proceedings of the Institution of Mechanical Engineers Part L Journal of Materials Design and Applications 2015 Ferreira.pdf:application/pdf",
    "local-url": "file://localhost/Users/jferreira/Dropbox/Library.papers3/Articles/2015/Ferreira/Proceedings%20of%20the%20Institution%20of%20Mechanical%20Engineers%20Part%20L%20Journal%20of%20Materials%20Design%20and%20Applications%202015%20Ferreira.pdf",
    "url": "http://pil.sagepub.com/lookup/doi/10.1177/1464420715592905",
    "date-modified": "2017-11-16T15:20:11GMT",
    "date-added": "2015-10-14T09:42:44GMT",
    "rating": "3",
    "read": "Yes",
    "language": "English",
    "doi": "10.1177/1464420715592905",
    "publisher": "SAGE Publications",
    "month": "July",
    "pages": "1–17",
    "number": "1",
    "volume": "230",
    "year": "<strong>2015</strong>",
    "journal": "Proceedings of the Institution of Mechanical Engineers, Part L: Journal of Materials: Design and Applications",
    "title": "Cellular modelling in functional tissue engineering: review oriented for pelvic floor dysfunctions",
    "author": "<strong>Ferreira, Joao</strong> and Parente, Marco and Mascarenhas, Teresa and Damaser, Margot and Jorge, Renato Natal"
  },
  {
    "type": "article",
    "key": "Ferreira:2015cg",
    "uri": "r̆lpapers3://publication/doi/10.1016/j.proeng.2015.07.002",
    "file": "E038C5CE-614B-4AD4-A585-6B2A739560D1.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/E0/E038C5CE-614B-4AD4-A585-6B2A739560D1.pdf:application/pdf;E038C5CE-614B-4AD4-A585-6B2A739560D1.pdf:/Users/jferreira/Google Drive/Library.papers3/Files/E0/E038C5CE-614B-4AD4-A585-6B2A739560D1.pdf:application/pdf",
    "howpublished": "conf",
    "url": "http://linkinghub.elsevier.com/retrieve/pii/S1877705815012436",
    "date-modified": "2016-09-22T12:22:00GMT",
    "date-added": "2016-05-03T15:05:29GMT",
    "rating": "0",
    "read": "Yes",
    "language": "English",
    "doi": "10.1016/j.proeng.2015.07.002",
    "pages": "2–7",
    "volume": "110",
    "year": "<strong>2015</strong>",
    "journal": "Procedia Engineering",
    "title": "Fibre Reinforcement in Living Cells: A Preliminary Study of the F-actin Filaments",
    "author": "<strong>Ferreira, Joao</strong> and Parente, Marco and Natal, Renato"
  },
  {
    "type": "inbook",
    "key": "Ferreira:2015ci",
    "isbn": "978-3-319-15799-3",
    "abstract": "Many active sportsmen trend to get injured in knee ligaments. For that reason, singular researches on the deformations limits of Anterior Cruciate Ligament (ACL) which ensure the stability of knee have been made. Understanding in detail the running of the knee plays an important role in the design of orthotics and prosthetics, and may also modify surgical protocols. As a consequence, the injury risk will be minimized with the right knowledge of the knee functioning. The Isogeometric Analysis has the potential to facilitate the study of the most of biomechanical models, which are usually geometrically complex. In this work, we present the deformation of ACL at an injury position using the isogeometric approach (IGA), suggested by Cottrell (Isogeometric analysis toward integration of CAD and FEA. Wiley, Hoboken, 2009) and Hughes et al. (Comput Methods Appl Mech Eng 194:4135–4195, 2005). Also is emphasized the potential of IGA formulations in future of the Biomechanics.",
    "pages": "105–121",
    "address": "Cham",
    "publisher": "Springer International Publishing",
    "doi": "10.1007/978-3-319-15799-3_8",
    "year": "<strong>2015</strong>",
    "booktitle": "Computational and Experimental Biomedical Sciences: Methods and Applications",
    "title": "Injury Simulation of Anterior Cruciate Ligament Using Isogeometric Analysis",
    "editor": "Tavares, João Manuel R. S. and Natal Jorge, R.M.",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge, R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_m2d15",
    "isbn": "978-989-98832-3-9",
    "pages": "1815",
    "year": "<strong>2015</strong>",
    "editor": "Silva Gomes, JF and Meguid, AS",
    "booktitle": "Proceedings of the 6th International Conference on Mechanics and Materials in Design, P. Delgada (Azores), Portugal, 26-30 July",
    "title": "Stem cells mechanics on regenerative procedures: a preliminary computational study of the actin network active behaviour",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_cmn15",
    "pages": "100",
    "year": "<strong>2015</strong>",
    "series": "Livro de Resumos",
    "booktitle": "Congresso de Métodos Numéricos em Engenharia, CMN 2015, Lisboa, Portugal, 29 June – 2 July",
    "title": "Elasto-plastic analysis of structures using an isogeometric formulation",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_3ejil",
    "pages": "49",
    "year": "<strong>2015</strong>",
    "series": "Book of Abstracts",
    "booktitle": "3rd LAETA Young Researchers Meeting, Coimbra, 7-8 May",
    "title": "Preliminary computational study of the actin network active behaviour",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal"
  },
  {
    "type": "mastersthesis",
    "key": "jferreira_mastersthesis",
    "url": "https://repositorio-aberto.up.pt/handle/10216/73123",
    "address": "Porto, Portugal",
    "year": "<strong>2014</strong>",
    "school": "Faculdade de Engenharia da Universidade do Porto",
    "title": "Elasto-plastic analysis of structures using an isogeometric formulation",
    "author": "<strong>Joao P S Ferreira</strong>"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_iccebs13",
    "pages": "abstract 34",
    "year": "<strong>2013</strong>",
    "series": "pen drive",
    "booktitle": "ICCEBS 2013 – International on Computational and Experimental Biomedical sciences, Ponta Delgada, Azores Islands, October 20-22",
    "editor": "Tavares, JMRS and Natal Jorge, RM",
    "title": "Injury simulation of anterior cruciate ligament using isogeometric analysis",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal,Fernandes, AA"
  },
  {
    "type": "inproceedings",
    "key": "ferreira_cnb2013",
    "year": "<strong>2013</strong>",
    "series": "IDMEC",
    "booktitle": "5º Congresso Nacional de Biomecânica 2013, Espinho, 8-9 de fevereiro",
    "editor": "Jorge, R M Natal and Tavares, João Manuel R S and Belinha, J and Parente, M P L and Martins, P A L S",
    "title": "Análise do campo de deformações nos ligamentos cruzados do joelho com formulação isogeométrica",
    "author": "<strong>Ferreira, J P S</strong> and Parente, M P L and Jorge R M Natal,Fernandes, AA"
  },
  {
    "type": "article",
    "key": "RibeiroTa2022",
    "note": "(<strong>FI: 4.369</strong>)",
    "abstract": "Abstract Background and Aim Colon capsule endoscopy (CCE) has become a minimally invasive alternative for conventional colonoscopy. Nevertheless, each CCE exam produces between 50 000 and 100 000 frames, making its analysis time-consuming and prone to errors. Convolutional neural networks (CNNs) are a type of artificial intelligence (AI) architecture with high performance in image analysis. This study aims to develop a CNN model for the identification of colonic ulcers and erosions in CCE images. Methods A CNN model was designed using a database of CCE images. A total of 124 CCE exams performed between 2010 and 2020 in two centers were reviewed. For CNN development, a total of 37 319 images were extracted, 33 749 showing normal colonic mucosa and 3570 showing colonic ulcers and erosions. Datasets for CNN training, validation, and testing were created. The performance of the algorithm was evaluated regarding its sensitivity, specificity, positive and negative predictive values, accuracy, and area under the curve. Results The network had a sensitivity of 96.9% and a specificity of 99.9% specific for the detection of colonic ulcers and erosions. The algorithm had an overall accuracy of 99.6%. The area under the curve was 1.00. The CNN had an image processing capacity of 90 frames per second. Conclusions The developed algorithm is the first CNN-based model to accurately detect ulcers and erosions in CCE images, also providing a good image processing performance. The development of these AI systems may contribute to improve both the diagnostic and time efficiency of CCE exams, facilitating CCE adoption to routine clinical practice.",
    "eprint": "https://onlinelibrary.wiley.com/doi/pdf/10.1111/jgh.16011",
    "url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jgh.16011",
    "doi": "https://doi.org/10.1111/jgh.16011",
    "keywords": "artificial intelligence, colon capsule endoscopy, convolutional neural network, inflammatory bowel disease, ulcers",
    "pages": "",
    "number": "n/a",
    "volume": "n/a",
    "journal": "Journal of Gastroenterology and Hepatology",
    "title": "Artificial intelligence and colon capsule endoscopy: Automatic detection of ulcers and erosions using a convolutional neural network",
    "author": "Ribeiro, Tiago and Mascarenhas, Miguel and Afonso, Joao and Cardoso, Helder and Andrade, Patricia and Lopes, Susana and <strong>Ferreira, João</strong> and Mascarenhas Saraiva, Miguel and Macedo, Guilherme"
  }
]